esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BB</name>
      <description>BB Peripheral</description>
      <groupName>BB</groupName>
      <baseAddress>0x6001D000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BBPD_CTRL</name>
          <description>Baseband control register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DC_EST_FORCE_PD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_EST_FORCE_PU</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FFT_FORCE_PD</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FFT_FORCE_PU</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ASSIST_DEBUG</name>
      <description>Debug Assist</description>
      <groupName>DEBUG_ASSIST</groupName>
      <baseAddress>0x600CE000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x15C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ASSIST_DEBUG</name>
        <value>83</value>
      </interrupt>
      <registers>
        <register>
          <name>CORE_0_MONTR_ENA</name>
          <description>core0 monitor enable configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_0_RD_ENA</name>
              <description>Core0 dram0 area0 read monitor enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_0_WR_ENA</name>
              <description>Core0 dram0 area0 write monitor enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_RD_ENA</name>
              <description>Core0 dram0 area1 read monitor enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_WR_ENA</name>
              <description>Core0 dram0 area1 write monitor enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_RD_ENA</name>
              <description>Core0 PIF area0 read monitor enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_WR_ENA</name>
              <description>Core0 PIF area0 write monitor enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_RD_ENA</name>
              <description>Core0 PIF area1 read monitor enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_WR_ENA</name>
              <description>Core0 PIF area1 write monitor enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MIN_ENA</name>
              <description>Core0 stackpoint overflow monitor enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MAX_ENA</name>
              <description>Core0 stackpoint underflow monitor enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_EXCEPTION_MONITOR_ENA</name>
              <description>IBUS busy monitor enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_EXCEPTION_MONITOR_ENA</name>
              <description>DBUS busy monitor enbale</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_INTR_RAW</name>
          <description>core0 monitor interrupt status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_0_RD_RAW</name>
              <description>Core0 dram0 area0 read monitor interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_0_WR_RAW</name>
              <description>Core0 dram0 area0 write monitor interrupt status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_RD_RAW</name>
              <description>Core0 dram0 area1 read monitor interrupt status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_WR_RAW</name>
              <description>Core0 dram0 area1 write monitor interrupt status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_RD_RAW</name>
              <description>Core0 PIF area0 read monitor interrupt status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_WR_RAW</name>
              <description>Core0 PIF area0 write monitor interrupt status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_RD_RAW</name>
              <description>Core0 PIF area1 read monitor interrupt status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_WR_RAW</name>
              <description>Core0 PIF area1 write monitor interrupt status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MIN_RAW</name>
              <description>Core0 stackpoint overflow monitor interrupt status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MAX_RAW</name>
              <description>Core0 stackpoint underflow monitor interrupt status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_EXCEPTION_MONITOR_RAW</name>
              <description>IBUS busy monitor interrupt status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_EXCEPTION_MONITOR_RAW</name>
              <description>DBUS busy monitor initerrupt status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_INTR_ENA</name>
          <description>core0 monitor interrupt enable register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_0_RD_INTR_ENA</name>
              <description>Core0 dram0 area0 read monitor interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_0_WR_INTR_ENA</name>
              <description>Core0 dram0 area0 write monitor interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_RD_INTR_ENA</name>
              <description>Core0 dram0 area1 read monitor interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_WR_INTR_ENA</name>
              <description>Core0 dram0 area1 write monitor interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_RD_INTR_ENA</name>
              <description>Core0 PIF area0 read monitor interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_WR_INTR_ENA</name>
              <description>Core0 PIF area0 write monitor interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_RD_INTR_ENA</name>
              <description>Core0 PIF area1 read monitor interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_WR_INTR_ENA</name>
              <description>Core0 PIF area1 write monitor interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MIN_INTR_ENA</name>
              <description>Core0 stackpoint overflow monitor interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MAX_INTR_ENA</name>
              <description>Core0 stackpoint underflow monitor interrupt enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_EXCEPTION_MONITOR_INTR_ENA</name>
              <description>IBUS busy monitor interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_EXCEPTION_MONITOR_INTR_ENA</name>
              <description>DBUS busy monitor interrupt enbale</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_INTR_CLR</name>
          <description>core0 monitor interrupt clr register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_0_RD_CLR</name>
              <description>Core0 dram0 area0 read monitor interrupt clr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_0_WR_CLR</name>
              <description>Core0 dram0 area0 write monitor interrupt clr</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_RD_CLR</name>
              <description>Core0 dram0 area1 read monitor interrupt clr</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_WR_CLR</name>
              <description>Core0 dram0 area1 write monitor interrupt clr</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_RD_CLR</name>
              <description>Core0 PIF area0 read monitor interrupt clr</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_WR_CLR</name>
              <description>Core0 PIF area0 write monitor interrupt clr</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_RD_CLR</name>
              <description>Core0 PIF area1 read monitor interrupt clr</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_WR_CLR</name>
              <description>Core0 PIF area1 write monitor interrupt clr</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MIN_CLR</name>
              <description>Core0 stackpoint overflow monitor interrupt clr</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MAX_CLR</name>
              <description>Core0 stackpoint underflow monitor interrupt clr</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_EXCEPTION_MONITOR_CLR</name>
              <description>IBUS busy monitor interrupt clr</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_EXCEPTION_MONITOR_CLR</name>
              <description>DBUS busy monitor interrupt clr</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_DRAM0_0_MIN</name>
          <description>core0 dram0 region0 addr configuration register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_0_MIN</name>
              <description>Core0 dram0 region0 start addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_DRAM0_0_MAX</name>
          <description>core0 dram0 region0 addr configuration register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_0_MAX</name>
              <description>Core0 dram0 region0 end addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_DRAM0_1_MIN</name>
          <description>core0 dram0 region1 addr configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_1_MIN</name>
              <description>Core0 dram0 region1 start addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_DRAM0_1_MAX</name>
          <description>core0 dram0 region1 addr configuration register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_1_MAX</name>
              <description>Core0 dram0 region1 end addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_PIF_0_MIN</name>
          <description>core0 PIF region0 addr configuration register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_AREA_PIF_0_MIN</name>
              <description>Core0 PIF region0 start addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_PIF_0_MAX</name>
          <description>core0 PIF region0 addr configuration register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_AREA_PIF_0_MAX</name>
              <description>Core0 PIF region0 end addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_PIF_1_MIN</name>
          <description>core0 PIF region1 addr configuration register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_AREA_PIF_1_MIN</name>
              <description>Core0 PIF region1 start addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_PIF_1_MAX</name>
          <description>core0 PIF region1 addr configuration register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_AREA_PIF_1_MAX</name>
              <description>Core0 PIF region1 end addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_SP</name>
          <description>core0 area sp status register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_AREA_SP</name>
              <description>the stackpointer when first touch region monitor interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_PC</name>
          <description>core0 area pc status register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_AREA_PC</name>
              <description>the PC when first touch region monitor interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_SP_UNSTABLE</name>
          <description>core0 sp unstable configuration register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>CORE_0_SP_UNSTABLE</name>
              <description>unstable period when window change,during this period no check stackpointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
