esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
        <register>
          <name>CORE_1_INTR_ENA</name>
          <description>Core1 monitor interrupt enable register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_0_RD_INTR_ENA</name>
              <description>Core1 dram0 area0 read monitor interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_DRAM0_0_WR_INTR_ENA</name>
              <description>Core1 dram0 area0 write monitor interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_DRAM0_1_RD_INTR_ENA</name>
              <description>Core1 dram0 area1 read monitor interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_DRAM0_1_WR_INTR_ENA</name>
              <description>Core1 dram0 area1 write monitor interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_0_RD_INTR_ENA</name>
              <description>Core1 PIF area0 read monitor interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_0_WR_INTR_ENA</name>
              <description>Core1 PIF area0 write monitor interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_1_RD_INTR_ENA</name>
              <description>Core1 PIF area1 read monitor interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_1_WR_INTR_ENA</name>
              <description>Core1 PIF area1 write monitor interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_SP_SPILL_MIN_INTR_ENA</name>
              <description>Core1 stackpoint overflow monitor interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_SP_SPILL_MAX_INTR_ENA</name>
              <description>Core1 stackpoint underflow monitor interrupt enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_EXCEPTION_MONITOR_INTR_ENA</name>
              <description>IBUS busy monitor interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_DRAM0_EXCEPTION_MONITOR_INTR_ENA</name>
              <description>DBUS busy monitor interrupt enbale</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_INTR_CLR</name>
          <description>Core1 monitor interrupt clr register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_0_RD_CLR</name>
              <description>Core1 dram0 area0 read monitor interrupt clr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_DRAM0_0_WR_CLR</name>
              <description>Core1 dram0 area0 write monitor interrupt clr</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_DRAM0_1_RD_CLR</name>
              <description>Core1 dram0 area1 read monitor interrupt clr</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_DRAM0_1_WR_CLR</name>
              <description>Core1 dram0 area1 write monitor interrupt clr</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_0_RD_CLR</name>
              <description>Core1 PIF area0 read monitor interrupt clr</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_0_WR_CLR</name>
              <description>Core1 PIF area0 write monitor interrupt clr</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_1_RD_CLR</name>
              <description>Core1 PIF area1 read monitor interrupt clr</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_1_WR_CLR</name>
              <description>Core1 PIF area1 write monitor interrupt clr</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_SP_SPILL_MIN_CLR</name>
              <description>Core1 stackpoint overflow monitor interrupt clr</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_SP_SPILL_MAX_CLR</name>
              <description>Core1 stackpoint underflow monitor interrupt clr</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_EXCEPTION_MONITOR_CLR</name>
              <description>IBUS busy monitor interrupt clr</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_DRAM0_EXCEPTION_MONITOR_CLR</name>
              <description>DBUS busy monitor interrupt clr</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_DRAM0_0_MIN</name>
          <description>Core1 dram0 region0 addr configuration register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_0_MIN</name>
              <description>Core1 dram0 region0 start addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_DRAM0_0_MAX</name>
          <description>Core1 dram0 region0 addr configuration register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_0_MAX</name>
              <description>Core1 dram0 region0 end addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_DRAM0_1_MIN</name>
          <description>Core1 dram0 region1 addr configuration register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_1_MIN</name>
              <description>Core1 dram0 region1 start addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_DRAM0_1_MAX</name>
          <description>Core1 dram0 region1 addr configuration register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_1_MAX</name>
              <description>Core1 dram0 region1 end addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_PIF_0_MIN</name>
          <description>Core1 PIF region0 addr configuration register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_AREA_PIF_0_MIN</name>
              <description>Core1 PIF region0 start addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_PIF_0_MAX</name>
          <description>Core1 PIF region0 addr configuration register</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_PIF_0_MAX</name>
              <description>Core1 PIF region0 end addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_PIF_1_MIN</name>
          <description>Core1 PIF region1 addr configuration register</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_AREA_PIF_1_MIN</name>
              <description>Core1 PIF region1 start addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_PIF_1_MAX</name>
          <description>Core1 PIF region1 addr configuration register</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_PIF_1_MAX</name>
              <description>Core1 PIF region1 end addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_PC</name>
          <description>Core1 area sp status register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_PC</name>
              <description>the stackpointer when first touch region monitor interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_SP</name>
          <description>Core1 area pc status register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_SP</name>
              <description>the PC when first touch region monitor interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_SP_UNSTABLE</name>
          <description>Core1 sp unstable configuration register</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>CORE_1_SP_UNSTABLE</name>
              <description>unstable period when window change,during this period no check stackpointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_SP_MIN</name>
          <description>Core1 sp region configuration regsiter</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_SP_MIN</name>
              <description>stack min value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_SP_MAX</name>
          <description>Core1 sp region configuration regsiter</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_SP_MAX</name>
              <description>stack max value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_SP_PC</name>
          <description>Core1 sp pc status register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_SP_PC</name>
              <description>the PC when first touch stack monitor interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_PDEBUGENABLE</name>
          <description>Core1 pdebug configuration register</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_RCD_PDEBUGENABLE</name>
              <description>Core1 Pdebugenable,set 1 to open Core1 Pdebug interface, then can get Core1 PC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_RECORDING</name>
          <description>Core1 pdebug status register</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_RCD_RECORDING</name>
              <description>Pdebug record enable,set 1 to record Core1 pdebug interface signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_PDEBUGINST</name>
          <description>Core1 pdebug status register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_RCD_PDEBUGINST</name>
              <description>Core1 pdebuginst</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_PDEBUGSTATUS</name>
          <description>Core1 pdebug status register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_RCD_PDEBUGSTATUS</name>
              <description>Core1 pdebugstatus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_PDEBUGDATA</name>
          <description>Core1 pdebug status register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_RCD_PDEBUGDATA</name>
              <description>Core1_pdebugdata</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_PDEBUGPC</name>
          <description>Core1 pdebug status register</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_RCD_PDEBUGPC</name>
              <description>Core1_pdebugPC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_PDEBUGLS0STAT</name>
          <description>Core1 pdebug status register</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_RCD_PDEBUGLS0STAT</name>
              <description>Core1_pdebug_s0stat</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_PDEBUGLS0ADDR</name>
          <description>Core1 pdebug status register</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_RCD_PDEBUGLS0ADDR</name>
              <description>Core1_pdebug_s0addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_PDEBUGLS0DATA</name>
          <description>Core1 pdebug status register</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_RCD_PDEBUGLS0DATA</name>
              <description>Core1_pdebug_s0data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_SP</name>
          <description>Core1 pdebug status register</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_RCD_SP</name>
              <description>Core1_stack pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_IRAM0_EXCEPTION_MONITOR_0</name>
          <description>Core1 bus busy status regsiter</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_IRAM0_RECORDING_ADDR_0</name>
              <description>The first iram0's addr[25:2] status when trigger IRAM busy interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_RECORDING_WR_0</name>
              <description>The first iram0's wr status when trigger IRAM busy interrupt</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_RECORDING_LOADSTORE_0</name>
              <description>The first iram0's loadstore status when trigger IRAM busy interrupt</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_IRAM0_EXCEPTION_MONITOR_1</name>
          <description>Core1 bus busy status regsiter</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_IRAM0_RECORDING_ADDR_1</name>
              <description>The second iram0's addr[25:2] status when trigger IRAM busy interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_RECORDING_WR_1</name>
              <description>The second iram0's wr status when trigger IRAM busy interrupt</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_RECORDING_LOADSTORE_1</name>
              <description>The second iram0's loadstore status when trigger IRAM busy interrupt</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
