esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
          <register>
            <name>INFIFO_STATUS</name>
            <description>Receive FIFO status of Rx channel 0</description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <resetValue>0x0F00003A</resetValue>
            <fields>
              <field>
                <name>INFIFO_FULL_L1</name>
                <description>L1 Rx FIFO full signal for Rx channel 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_EMPTY_L1</name>
                <description>L1 Rx FIFO empty signal for Rx channel 0.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_FULL_L2</name>
                <description>L2 Rx FIFO full signal for Rx channel 0.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_EMPTY_L2</name>
                <description>L2 Rx FIFO empty signal for Rx channel 0.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_FULL_L3</name>
                <description>L3 Rx FIFO full signal for Rx channel 0.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_EMPTY_L3</name>
                <description>L3 Rx FIFO empty signal for Rx channel 0.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_CNT_L1</name>
                <description>The register stores the byte number of the data in L1 Rx FIFO for Rx channel 0.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_CNT_L2</name>
                <description>The register stores the byte number of the data in L2 Rx FIFO for Rx channel 0.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_CNT_L3</name>
                <description>The register stores the byte number of the data in L3 Rx FIFO for Rx channel 0.</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_REMAIN_UNDER_1B_L3</name>
                <description>reserved</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_REMAIN_UNDER_2B_L3</name>
                <description>reserved</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_REMAIN_UNDER_3B_L3</name>
                <description>reserved</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_REMAIN_UNDER_4B_L3</name>
                <description>reserved</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_BUF_HUNGRY</name>
                <description>reserved</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_POP</name>
            <description>Pop control register of Rx channel 0</description>
            <addressOffset>0x1C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000800</resetValue>
            <fields>
              <field>
                <name>INFIFO_RDATA</name>
                <description>This register stores the data popping from DMA FIFO.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_POP</name>
                <description>Set this bit to pop data from DMA FIFO.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_LINK</name>
            <description>Link descriptor configure and control register of Rx channel 0</description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <resetValue>0x01100000</resetValue>
            <fields>
              <field>
                <name>INLINK_ADDR</name>
                <description>This register stores the 20 least significant bits of the first inlink descriptor's address.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INLINK_AUTO_RET</name>
                <description>Set this bit to return to current inlink descriptor's address, when there are some errors in current receiving data.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INLINK_STOP</name>
                <description>Set this bit to stop dealing with the inlink descriptors.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INLINK_START</name>
                <description>Set this bit to start dealing with the inlink descriptors.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INLINK_RESTART</name>
                <description>Set this bit to mount a new inlink descriptor.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INLINK_PARK</name>
                <description>1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is working.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_STATE</name>
            <description>Receive status of Rx channel 0</description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>INLINK_DSCR_ADDR</name>
                <description>This register stores the current inlink descriptor's address.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_DSCR_STATE</name>
                <description>reserved</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_STATE</name>
                <description>reserved</description>
                <bitOffset>20</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_SUC_EOF_DES_ADDR</name>
            <description>Inlink descriptor address when EOF occurs of Rx channel 0</description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_SUC_EOF_DES_ADDR</name>
                <description>This register stores the address of the inlink descriptor when the EOF bit in this descriptor is 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_ERR_EOF_DES_ADDR</name>
            <description>Inlink descriptor address when errors occur of Rx channel 0</description>
            <addressOffset>0x2C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_ERR_EOF_DES_ADDR</name>
                <description>This register stores the address of the inlink descriptor when there are some errors in current receiving data. Only used when peripheral is UHCI0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_DSCR</name>
            <description>Current inlink descriptor address of Rx channel 0</description>
            <addressOffset>0x30</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>INLINK_DSCR</name>
                <description>The address of the current inlink descriptor x.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_DSCR_BF0</name>
            <description>The last inlink descriptor address of Rx channel 0</description>
            <addressOffset>0x34</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>INLINK_DSCR_BF0</name>
                <description>The address of the last inlink descriptor x-1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_DSCR_BF1</name>
            <description>The second-to-last inlink descriptor address of Rx channel 0</description>
            <addressOffset>0x38</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>INLINK_DSCR_BF1</name>
                <description>The address of the second-to-last inlink descriptor x-2.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_WIGHT</name>
            <description>Weight register of Rx channel 0</description>
            <addressOffset>0x3C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000F00</resetValue>
            <fields>
              <field>
                <name>RX_WEIGHT</name>
                <description>The weight of Rx channel 0.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_PRI</name>
            <description>Priority register of Rx channel 0</description>
            <addressOffset>0x44</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>RX_PRI</name>
                <description>The priority of Rx channel 0. The larger of the value, the higher of the priority.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_PERI_SEL</name>
            <description>Peripheral selection of Rx channel 0</description>
            <addressOffset>0x48</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000003F</resetValue>
            <fields>
              <field>
                <name>PERI_IN_SEL</name>
                <description>This register is used to select peripheral for Rx channel 0. 0:SPI2. 1: SPI3. 2: UHCI0. 3: I2S0. 4: I2S1. 5: LCD_CAM. 6: AES. 7: SHA. 8: ADC_DAC. 9: RMT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_CONF0</name>
            <description>Configure 0 register of Tx channel 0</description>
            <addressOffset>0x60</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000008</resetValue>
            <fields>
              <field>
                <name>OUT_RST</name>
                <description>This bit is used to reset DMA channel 0 Tx FSM and Tx FIFO pointer.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_LOOP_TEST</name>
                <description>reserved</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_AUTO_WRBACK</name>
                <description>Set this bit to enable automatic outlink-writeback when all the data in tx buffer has been transmitted.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_EOF_MODE</name>
                <description>EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel 0 is generated when data need to transmit has been popped from FIFO in DMA</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTDSCR_BURST_EN</name>
                <description>Set this bit to 1 to enable INCR burst transfer for Tx channel 0 reading link descriptor when accessing internal SRAM.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_DATA_BURST_EN</name>
                <description>Set this bit to 1 to enable INCR burst transfer for Tx channel 0 transmitting data when accessing internal SRAM.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_CONF1</name>
            <description>Configure 1 register of Tx channel 0</description>
            <addressOffset>0x64</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_CHECK_OWNER</name>
                <description>Set this bit to enable checking the owner attribute of the link descriptor.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_EXT_MEM_BK_SIZE</name>
                <description>Block size of Tx channel 0 when DMA access external SRAM. 0: 16 bytes      1: 32 bytes    2/3:reserved</description>
                <bitOffset>13</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <cluster>
            <name>OUT_INT</name>
            <description>Cluster OUT_INT, containing OUT_INT_RAW, OUT_INT_ST, OUT_INT_ENA, OUT_INT_CLR</description>
            <addressOffset>0x68</addressOffset>
            <register>
              <name>RAW</name>
              <description>Raw status interrupt of Tx channel 0</description>
              <addressOffset>0x0</addressOffset>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OUT_DONE</name>
                  <description>The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been transmitted to peripherals for Tx channel 0.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OUT_EOF</name>
                  <description>The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been read from memory for Tx channel 0.</description>
                  <bitOffset>1</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OUT_DSCR_ERR</name>
                  <description>The raw interrupt bit turns to high level when detecting outlink descriptor error, including owner error, the second and third word error of outlink descriptor for Tx channel 0.</description>
                  <bitOffset>2</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OUT_TOTAL_EOF</name>
                  <description>The raw interrupt bit turns to high level when data corresponding a outlink (includes one link descriptor or few link descriptors) is transmitted out for Tx channel 0.</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OUTFIFO_OVF_L1</name>
                  <description>This raw interrupt bit turns to high level when level 1 fifo of Tx channel 0 is overflow.</description>
                  <bitOffset>4</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OUTFIFO_UDF_L1</name>
                  <description>This raw interrupt bit turns to high level when level 1 fifo of Tx channel 0 is underflow.</description>
                  <bitOffset>5</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OUTFIFO_OVF_L3</name>
                  <description>This raw interrupt bit turns to high level when level 3 fifo of Tx channel 0 is overflow.</description>
                  <bitOffset>6</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OUTFIFO_UDF_L3</name>
                  <description>This raw interrupt bit turns to high level when level 3 fifo of Tx channel 0 is underflow.</description>
                  <bitOffset>7</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>ST</name>
              <description>Masked interrupt of Tx channel 0</description>
              <addressOffset>0x4</addressOffset>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OUT_DONE</name>
                  <description>The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>OUT_EOF</name>
                  <description>The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.</description>
                  <bitOffset>1</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>OUT_DSCR_ERR</name>
                  <description>The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.</description>
                  <bitOffset>2</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>OUT_TOTAL_EOF</name>
                  <description>The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>OUTFIFO_OVF_L1</name>
                  <description>The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.</description>
                  <bitOffset>4</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>OUTFIFO_UDF_L1</name>
                  <description>The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.</description>
                  <bitOffset>5</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>OUTFIFO_OVF_L3</name>
                  <description>The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.</description>
                  <bitOffset>6</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>OUTFIFO_UDF_L3</name>
                  <description>The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.</description>
                  <bitOffset>7</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
