esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
            <register>
              <name>ENA</name>
              <description>Interrupt enable bits of Tx channel 0</description>
              <addressOffset>0x8</addressOffset>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OUT_DONE</name>
                  <description>The interrupt enable bit for the OUT_DONE_CH_INT interrupt.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OUT_EOF</name>
                  <description>The interrupt enable bit for the OUT_EOF_CH_INT interrupt.</description>
                  <bitOffset>1</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OUT_DSCR_ERR</name>
                  <description>The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.</description>
                  <bitOffset>2</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OUT_TOTAL_EOF</name>
                  <description>The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OUTFIFO_OVF_L1</name>
                  <description>The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.</description>
                  <bitOffset>4</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OUTFIFO_UDF_L1</name>
                  <description>The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.</description>
                  <bitOffset>5</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OUTFIFO_OVF_L3</name>
                  <description>The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.</description>
                  <bitOffset>6</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OUTFIFO_UDF_L3</name>
                  <description>The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.</description>
                  <bitOffset>7</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>CLR</name>
              <description>Interrupt clear bits of Tx channel 0</description>
              <addressOffset>0xC</addressOffset>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OUT_DONE</name>
                  <description>Set this bit to clear the OUT_DONE_CH_INT interrupt.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>write-only</access>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>OUT_EOF</name>
                  <description>Set this bit to clear the OUT_EOF_CH_INT interrupt.</description>
                  <bitOffset>1</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>write-only</access>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>OUT_DSCR_ERR</name>
                  <description>Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.</description>
                  <bitOffset>2</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>write-only</access>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>OUT_TOTAL_EOF</name>
                  <description>Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>write-only</access>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>OUTFIFO_OVF_L1</name>
                  <description>Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.</description>
                  <bitOffset>4</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>write-only</access>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>OUTFIFO_UDF_L1</name>
                  <description>Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.</description>
                  <bitOffset>5</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>write-only</access>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>OUTFIFO_OVF_L3</name>
                  <description>Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.</description>
                  <bitOffset>6</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>write-only</access>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>OUTFIFO_UDF_L3</name>
                  <description>Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.</description>
                  <bitOffset>7</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>write-only</access>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>OUTFIFO_STATUS</name>
            <description>Transmit FIFO status of Tx channel 0</description>
            <addressOffset>0x78</addressOffset>
            <size>0x20</size>
            <resetValue>0x0780002A</resetValue>
            <fields>
              <field>
                <name>OUTFIFO_FULL_L1</name>
                <description>L1 Tx FIFO full signal for Tx channel 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_EMPTY_L1</name>
                <description>L1 Tx FIFO empty signal for Tx channel 0.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_FULL_L2</name>
                <description>L2 Tx FIFO full signal for Tx channel 0.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_EMPTY_L2</name>
                <description>L2 Tx FIFO empty signal for Tx channel 0.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_FULL_L3</name>
                <description>L3 Tx FIFO full signal for Tx channel 0.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_EMPTY_L3</name>
                <description>L3 Tx FIFO empty signal for Tx channel 0.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_CNT_L1</name>
                <description>The register stores the byte number of the data in L1 Tx FIFO for Tx channel 0.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_CNT_L2</name>
                <description>The register stores the byte number of the data in L2 Tx FIFO for Tx channel 0.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_CNT_L3</name>
                <description>The register stores the byte number of the data in L3 Tx FIFO for Tx channel 0.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_1B_L3</name>
                <description>reserved</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_2B_L3</name>
                <description>reserved</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_3B_L3</name>
                <description>reserved</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_4B_L3</name>
                <description>reserved</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_PUSH</name>
            <description>Push control register of Rx channel 0</description>
            <addressOffset>0x7C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTFIFO_WDATA</name>
                <description>This register stores the data that need to be pushed into DMA FIFO.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTFIFO_PUSH</name>
                <description>Set this bit to push data into DMA FIFO.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_LINK</name>
            <description>Link descriptor configure and control register of Tx channel 0</description>
            <addressOffset>0x80</addressOffset>
            <size>0x20</size>
            <resetValue>0x00800000</resetValue>
            <fields>
              <field>
                <name>OUTLINK_ADDR</name>
                <description>This register stores the 20 least significant bits of the first outlink descriptor's address.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTLINK_STOP</name>
                <description>Set this bit to stop dealing with the outlink descriptors.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTLINK_START</name>
                <description>Set this bit to start dealing with the outlink descriptors.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTLINK_RESTART</name>
                <description>Set this bit to restart a new outlink from the last address.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTLINK_PARK</name>
                <description>1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM is working.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_STATE</name>
            <description>Transmit status of Tx channel 0</description>
            <addressOffset>0x84</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR_ADDR</name>
                <description>This register stores the current outlink descriptor's address.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_DSCR_STATE</name>
                <description>reserved</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_STATE</name>
                <description>reserved</description>
                <bitOffset>20</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_EOF_DES_ADDR</name>
            <description>Outlink descriptor address when EOF occurs of Tx channel 0</description>
            <addressOffset>0x88</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_EOF_DES_ADDR</name>
                <description>This register stores the address of the outlink descriptor when the EOF bit in this descriptor is 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_EOF_BFR_DES_ADDR</name>
            <description>The last outlink descriptor address when EOF occurs of Tx channel 0</description>
            <addressOffset>0x8C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_EOF_BFR_DES_ADDR</name>
                <description>This register stores the address of the outlink descriptor before the last outlink descriptor.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_DSCR</name>
            <description>Current inlink descriptor address of Tx channel 0</description>
            <addressOffset>0x90</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR</name>
                <description>The address of the current outlink descriptor y.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_DSCR_BF0</name>
            <description>The last inlink descriptor address of Tx channel 0</description>
            <addressOffset>0x94</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR_BF0</name>
                <description>The address of the last outlink descriptor y-1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_DSCR_BF1</name>
            <description>The second-to-last inlink descriptor address of Tx channel 0</description>
            <addressOffset>0x98</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR_BF1</name>
                <description>The address of the second-to-last inlink descriptor x-2.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_WIGHT</name>
            <description>Weight register of Rx channel 0</description>
            <addressOffset>0x9C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000F00</resetValue>
            <fields>
              <field>
                <name>TX_WEIGHT</name>
                <description>The weight of Tx channel 0.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_PRI</name>
            <description>Priority register of Tx channel 0.</description>
            <addressOffset>0xA4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>TX_PRI</name>
                <description>The priority of Tx channel 0. The larger of the value, the higher of the priority.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_PERI_SEL</name>
            <description>Peripheral selection of Tx channel 0</description>
            <addressOffset>0xA8</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000003F</resetValue>
            <fields>
              <field>
                <name>PERI_OUT_SEL</name>
                <description>This register is used to select peripheral for Tx channel 0. 0:SPI2. 1: SPI3. 2: UHCI0. 3: I2S0. 4: I2S1. 5: LCD_CAM. 6: AES. 7: SHA. 8: ADC_DAC. 9: RMT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>AHB_TEST</name>
          <description>reserved</description>
          <addressOffset>0x3C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AHB_TESTMODE</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_TESTADDR</name>
              <description>reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PD_CONF</name>
          <description>reserved</description>
          <addressOffset>0x3C4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000020</resetValue>
          <fields>
            <field>
              <name>DMA_RAM_FORCE_PD</name>
              <description>Set this bit to force power down DMA internal memory.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RAM_FORCE_PU</name>
              <description>Set this bit to force power up DMA internal memory</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RAM_CLK_FO</name>
              <description>1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA. 0: A gate-clock will be used when accessing the RAM in DMA.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_CONF</name>
          <description>MISC register</description>
          <addressOffset>0x3C8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AHBM_RST_INTER</name>
              <description>Set this bit, then clear this bit to reset the internal ahb FSM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBM_RST_EXTER</name>
              <description>Set this bit, then clear this bit to reset the external ahb FSM.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARB_PRI_DIS</name>
              <description>Set this bit to disable priority arbitration function.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>1'h1: Force clock on for register. 1'h0: Support clock only when application writes registers.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>IN_SRAM_SIZE_CH%s</name>
          <description>Receive L2 FIFO depth of Rx channel 0</description>
          <addressOffset>0x3CC</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000E</resetValue>
          <fields>
            <field>
              <name>IN_SIZE</name>
              <description>This register is used to configure the size of L2 Tx FIFO for Rx channel 0. 0:16 bytes. 1:24 bytes. 2:32 bytes. 3: 40 bytes. 4: 48 bytes. 5:56 bytes. 6: 64 bytes. 7: 72 bytes. 8: 80 bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
