esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
        <register>
          <dim>5</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>OUT_SRAM_SIZE_CH%s</name>
          <description>Transmit L2 FIFO depth of Tx channel 0</description>
          <addressOffset>0x3D0</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000E</resetValue>
          <fields>
            <field>
              <name>OUT_SIZE</name>
              <description>This register is used to configure the size of L2 Tx FIFO for Tx channel 0. 0:16 bytes. 1:24 bytes. 2:32 bytes. 3: 40 bytes. 4: 48 bytes. 5:56 bytes. 6: 64 bytes. 7: 72 bytes. 8: 80 bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTMEM_REJECT_ADDR</name>
          <description>Reject address accessing external RAM</description>
          <addressOffset>0x3F4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EXTMEM_REJECT_ADDR</name>
              <description>This register store the first address rejected by permission control when accessing external RAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTMEM_REJECT_ST</name>
          <description>Reject status accessing external RAM</description>
          <addressOffset>0x3F8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EXTMEM_REJECT_ATRR</name>
              <description>The reject accessing. Bit 0: if this bit is 1, the rejected accessing is READ. Bit 1: if this bit is 1, the rejected accessing is WRITE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTMEM_REJECT_CHANNEL_NUM</name>
              <description>The register indicate the reject accessing from which channel.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTMEM_REJECT_PERI_NUM</name>
              <description>This register indicate reject accessing from which peripheral.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTMEM_REJECT_INT_RAW</name>
          <description>Raw interrupt status of external RAM permission</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EXTMEM_REJECT_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when accessing external RAM is rejected by permission control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTMEM_REJECT_INT_ST</name>
          <description>Masked interrupt status of external RAM permission</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EXTMEM_REJECT_INT_ST</name>
              <description>The raw interrupt status bit for the EXTMEM_REJECT_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTMEM_REJECT_INT_ENA</name>
          <description>Interrupt enable bits of external RAM permission</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EXTMEM_REJECT_INT_ENA</name>
              <description>The interrupt enable bit for the EXTMEM_REJECT_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTMEM_REJECT_INT_CLR</name>
          <description>Interrupt clear bits of external RAM permission</description>
          <addressOffset>0x408</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EXTMEM_REJECT_INT_CLR</name>
              <description>Set this bit to clear the EXTMEM_REJECT_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x40C</addressOffset>
          <size>0x20</size>
          <resetValue>0x02101180</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>register version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DS</name>
      <description>Digital Signature</description>
      <groupName>DS</groupName>
      <baseAddress>0x6003D000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xA5C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>396</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>C_MEM[%s]</name>
          <description>Memory C</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IV_%s</name>
          <description>IV block data</description>
          <addressOffset>0x630</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IV</name>
              <description>Stores IV block data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>128</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>X_MEM[%s]</name>
          <description>Memory X</description>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>128</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>Z_MEM[%s]</name>
          <description>Memory Z</description>
          <addressOffset>0xA00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SET_START</name>
          <description>Activates the DS peripheral</description>
          <addressOffset>0xE00</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_START</name>
              <description>Write 1 to this register to active the DS peripheral</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_ME</name>
          <description>Starts DS operation</description>
          <addressOffset>0xE04</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_ME</name>
              <description>Write 1 to this register to start DS operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_FINISH</name>
          <description>Ends DS operation</description>
          <addressOffset>0xE08</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_FINISH</name>
              <description>Write 1 to this register to end DS operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_BUSY</name>
          <description>Status of the DS perihperal</description>
          <addressOffset>0xE0C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>QUERY_BUSY</name>
              <description>Stores the status of the DS peripheral. 1: The DS peripheral is busy. 0: The DS peripheral is idle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_KEY_WRONG</name>
          <description>Checks the reason why DS_KEY is not ready</description>
          <addressOffset>0xE10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>QUERY_KEY_WRONG</name>
              <description>1-15: HMAC was activated, but the DS peripheral did not successfully receive the DS_KEY from the HMAC peripheral. (The biggest value is 15). 0: HMAC is not activated.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_CHECK</name>
          <description>Queries DS check result</description>
          <addressOffset>0xE14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MD_ERROR</name>
              <description>MD checkout result. 1: The MD check fails. 0: The MD check passes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PADDING_BAD</name>
              <description>padding checkout result. 1: The padding check fails. 0: The padding check passes.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>DS version control register</description>
          <addressOffset>0xE20</addressOffset>
          <size>0x20</size>
          <resetValue>0x20191217</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>ds version information</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
