esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>INTERRUPT_CORE0</name>
      <description>Interrupt Controller (Core 0)</description>
      <groupName>INTERRUPT_CORE0</groupName>
      <baseAddress>0x600C2000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1A4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WIFI_MAC</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>WIFI_NMI</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>WIFI_PWR</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>WIFI_BB</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>BT_MAC</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>BT_BB</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>BT_BB_NMI</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>RWBT</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>RWBLE</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>RWBT_NMI</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>RWBLE_NMI</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>SLC0</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>SLC1</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>SDIO_HOST</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>CACHE_IA</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>DCACHE_PRELOAD0</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>ICACHE_PRELOAD0</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>DCACHE_SYNC0</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>ICACHE_SYNC0</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR0</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR1</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR2</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR3</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>CORE0_IRAM0_PMS</name>
        <value>85</value>
      </interrupt>
      <interrupt>
        <name>CORE0_DRAM0_PMS</name>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>CORE0_PIF_PMS</name>
        <value>87</value>
      </interrupt>
      <interrupt>
        <name>CORE0_PIF_PMS_SIZE</name>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>CACHE_CORE0_ACS</name>
        <value>94</value>
      </interrupt>
      <registers>
        <register>
          <name>PRO_MAC_INTR_MAP</name>
          <description>mac interrupt configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>MAC_INTR_MAP</name>
              <description>this register used to map mac interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_NMI_MAP</name>
          <description>mac_nmi interrupt configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>MAC_NMI_MAP</name>
              <description>this register used to map_nmi interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_INTR_MAP</name>
          <description>pwr interrupt configuration register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PWR_INTR_MAP</name>
              <description>this register used to map pwr interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BB_INT_MAP</name>
          <description>bb interrupt configuration register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>BB_INT_MAP</name>
              <description>this register used to map bb interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_MAC_INT_MAP</name>
          <description>bb_mac interrupt configuration register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>BT_MAC_INT_MAP</name>
              <description>this register used to map bb_mac interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_BB_INT_MAP</name>
          <description>bt_bb interrupt configuration register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>BT_BB_INT_MAP</name>
              <description>this register used to map bt_bb interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_BB_NMI_MAP</name>
          <description>bt_bb_nmi interrupt configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>BT_BB_NMI_MAP</name>
              <description>this register used to map bb_bt_nmi interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWBT_IRQ_MAP</name>
          <description>rwbt_irq interrupt configuration register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>RWBT_IRQ_MAP</name>
              <description>this register used to map rwbt_irq interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWBLE_IRQ_MAP</name>
          <description>rwble_irq interrupt configuration register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>RWBLE_IRQ_MAP</name>
              <description>this register used to map rwble_irq interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWBT_NMI_MAP</name>
          <description>rwbt_nmi interrupt configuration register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>RWBT_NMI_MAP</name>
              <description>this register used to map mac rwbt_nmi to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWBLE_NMI_MAP</name>
          <description>rwble_nmi interrupt configuration register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>RWBLE_NMI_MAP</name>
              <description>this register used to map rwble_nmi interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MST_INT_MAP</name>
          <description>i2c_mst interrupt configuration register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>I2C_MST_INT_MAP</name>
              <description>this register used to map i2c_mst interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0_INTR_MAP</name>
          <description>slc0 interrupt configuration register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SLC0_INTR_MAP</name>
              <description>this register used to map slc0 interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1_INTR_MAP</name>
          <description>slc1 interrupt configuration register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SLC1_INTR_MAP</name>
              <description>this register used to map slc1 interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UHCI0_INTR_MAP</name>
          <description>uhci0 interrupt configuration register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>UHCI0_INTR_MAP</name>
              <description>this register used to map uhci0 interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UHCI1_INTR_MAP</name>
          <description>uhci1 interrupt configuration register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>UHCI1_INTR_MAP</name>
              <description>this register used to map uhci1 interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INTERRUPT_PRO_MAP</name>
          <description>gpio_interrupt_pro interrupt configuration register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>GPIO_INTERRUPT_PRO_MAP</name>
              <description>this register used to map gpio_interrupt_pro interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INTERRUPT_PRO_NMI_MAP</name>
          <description>gpio_interrupt_pro_nmi interrupt configuration register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>GPIO_INTERRUPT_PRO_NMI_MAP</name>
              <description>this register used to map gpio_interrupt_pro_nmi interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INTERRUPT_APP_MAP</name>
          <description>gpio_interrupt_app interrupt configuration register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>GPIO_INTERRUPT_APP_MAP</name>
              <description>this register used to map gpio_interrupt_app interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INTERRUPT_APP_NMI_MAP</name>
          <description>gpio_interrupt_app_nmi interrupt configuration register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>GPIO_INTERRUPT_APP_NMI_MAP</name>
              <description>this register used to map gpio_interrupt_app_nmi interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_INTR_1_MAP</name>
          <description>spi_intr_1 interrupt configuration register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SPI_INTR_1_MAP</name>
              <description>this register used to map spi_intr_1 interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_INTR_2_MAP</name>
          <description>spi_intr_2 interrupt configuration register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SPI_INTR_2_MAP</name>
              <description>this register used to map spi_intr_2 interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_INTR_3_MAP</name>
          <description>spi_intr_3 interrupt configuration register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SPI_INTR_3_MAP</name>
              <description>this register used to map spi_intr_3 interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_INTR_4_MAP</name>
          <description>spi_intr_4 interrupt configuration register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SPI_INTR_4_MAP</name>
              <description>this register used to map spi_intr_4 interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD_CAM_INT_MAP</name>
          <description>lcd_cam interrupt configuration register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>LCD_CAM_INT_MAP</name>
              <description>this register used to map lcd_cam interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S0_INT_MAP</name>
          <description>i2s0 interrupt configuration register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>I2S0_INT_MAP</name>
              <description>this register used to map i2s0 interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S1_INT_MAP</name>
          <description>i2s1 interrupt configuration register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>I2S1_INT_MAP</name>
              <description>this register used to map i2s1 interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_INTR_MAP</name>
          <description>uart interrupt configuration register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>UART_INTR_MAP</name>
              <description>this register used to map uart interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART1_INTR_MAP</name>
          <description>uart1 interrupt configuration register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>UART1_INTR_MAP</name>
              <description>this register used to map uart1 interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART2_INTR_MAP</name>
          <description>uart2 interrupt configuration register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>UART2_INTR_MAP</name>
              <description>this register used to map uart2 interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_HOST_INTERRUPT_MAP</name>
          <description>sdio_host interrupt configuration register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SDIO_HOST_INTERRUPT_MAP</name>
              <description>this register used to map sdio_host interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM0_INTR_MAP</name>
          <description>pwm0 interrupt configuration register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PWM0_INTR_MAP</name>
              <description>this register used to map pwm0 interrupt to one of core0's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
