esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>INTERRUPT_CORE1</name>
      <description>Interrupt Controller (Core 1)</description>
      <groupName>INTERRUPT_CORE1</groupName>
      <baseAddress>0x600C2000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1A4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CORE1_IRAM0_PMS</name>
        <value>89</value>
      </interrupt>
      <interrupt>
        <name>CORE1_DRAM0_PMS</name>
        <value>90</value>
      </interrupt>
      <interrupt>
        <name>CORE1_PIF_PMS</name>
        <value>91</value>
      </interrupt>
      <interrupt>
        <name>CORE1_PIF_PMS_SIZE</name>
        <value>92</value>
      </interrupt>
      <interrupt>
        <name>CACHE_CORE1_ACS</name>
        <value>95</value>
      </interrupt>
      <registers>
        <register>
          <name>APP_MAC_INTR_MAP</name>
          <description>mac interrupt configuration register</description>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>MAC_INTR_MAP</name>
              <description>this register used to map mac interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_NMI_MAP</name>
          <description>mac_nmi interrupt configuration register</description>
          <addressOffset>0x804</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>MAC_NMI_MAP</name>
              <description>this register used to map_nmi interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_INTR_MAP</name>
          <description>pwr interrupt configuration register</description>
          <addressOffset>0x808</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PWR_INTR_MAP</name>
              <description>this register used to map pwr interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BB_INT_MAP</name>
          <description>bb interrupt configuration register</description>
          <addressOffset>0x80C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>BB_INT_MAP</name>
              <description>this register used to map bb interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_MAC_INT_MAP</name>
          <description>bb_mac interrupt configuration register</description>
          <addressOffset>0x810</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>BT_MAC_INT_MAP</name>
              <description>this register used to map bb_mac interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_BB_INT_MAP</name>
          <description>bt_bb interrupt configuration register</description>
          <addressOffset>0x814</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>BT_BB_INT_MAP</name>
              <description>this register used to map bt_bb interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_BB_NMI_MAP</name>
          <description>bt_bb_nmi interrupt configuration register</description>
          <addressOffset>0x818</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>BT_BB_NMI_MAP</name>
              <description>this register used to map bb_bt_nmi interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWBT_IRQ_MAP</name>
          <description>rwbt_irq interrupt configuration register</description>
          <addressOffset>0x81C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>RWBT_IRQ_MAP</name>
              <description>this register used to map rwbt_irq interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWBLE_IRQ_MAP</name>
          <description>rwble_irq interrupt configuration register</description>
          <addressOffset>0x820</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>RWBLE_IRQ_MAP</name>
              <description>this register used to map rwble_irq interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWBT_NMI_MAP</name>
          <description>rwbt_nmi interrupt configuration register</description>
          <addressOffset>0x824</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>RWBT_NMI_MAP</name>
              <description>this register used to map rwbt_nmi interupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWBLE_NMI_MAP</name>
          <description>rwble_nmi interrupt configuration register</description>
          <addressOffset>0x828</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>RWBLE_NMI_MAP</name>
              <description>this register used to map rwble_nmi interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MST_INT_MAP</name>
          <description>i2c_mst interrupt configuration register</description>
          <addressOffset>0x82C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>I2C_MST_INT_MAP</name>
              <description>this register used to map i2c_mst interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0_INTR_MAP</name>
          <description>slc0 interrupt configuration register</description>
          <addressOffset>0x830</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SLC0_INTR_MAP</name>
              <description>this register used to map slc0 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1_INTR_MAP</name>
          <description>slc1 interrupt configuration register</description>
          <addressOffset>0x834</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SLC1_INTR_MAP</name>
              <description>this register used to map slc1 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UHCI0_INTR_MAP</name>
          <description>uhci0 interrupt configuration register</description>
          <addressOffset>0x838</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>UHCI0_INTR_MAP</name>
              <description>this register used to map uhci0 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UHCI1_INTR_MAP</name>
          <description>uhci1 interrupt configuration register</description>
          <addressOffset>0x83C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>UHCI1_INTR_MAP</name>
              <description>this register used to map uhci1 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INTERRUPT_PRO_MAP</name>
          <description>gpio_interrupt_pro interrupt configuration register</description>
          <addressOffset>0x840</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>GPIO_INTERRUPT_PRO_MAP</name>
              <description>this register used to map gpio_interrupt_pro interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INTERRUPT_PRO_NMI_MAP</name>
          <description>gpio_interrupt_pro_nmi interrupt configuration register</description>
          <addressOffset>0x844</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>GPIO_INTERRUPT_PRO_NMI_MAP</name>
              <description>this register used to map gpio_interrupt_pro_nmi interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INTERRUPT_APP_MAP</name>
          <description>gpio_interrupt_app interrupt configuration register</description>
          <addressOffset>0x848</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>GPIO_INTERRUPT_APP_MAP</name>
              <description>this register used to map gpio_interrupt_app interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INTERRUPT_APP_NMI_MAP</name>
          <description>gpio_interrupt_app_nmi interrupt configuration register</description>
          <addressOffset>0x84C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>GPIO_INTERRUPT_APP_NMI_MAP</name>
              <description>this register used to map gpio_interrupt_app_nmi interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_INTR_1_MAP</name>
          <description>spi_intr_1 interrupt configuration register</description>
          <addressOffset>0x850</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SPI_INTR_1_MAP</name>
              <description>this register used to map spi_intr_1 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_INTR_2_MAP</name>
          <description>spi_intr_2 interrupt configuration register</description>
          <addressOffset>0x854</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SPI_INTR_2_MAP</name>
              <description>this register used to map spi_intr_2 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_INTR_3_MAP</name>
          <description>spi_intr_3 interrupt configuration register</description>
          <addressOffset>0x858</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SPI_INTR_3_MAP</name>
              <description>this register used to map spi_intr_3 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_INTR_4_MAP</name>
          <description>spi_intr_4 interrupt configuration register</description>
          <addressOffset>0x85C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SPI_INTR_4_MAP</name>
              <description>this register used to map spi_intr_4 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD_CAM_INT_MAP</name>
          <description>lcd_cam interrupt configuration register</description>
          <addressOffset>0x860</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>LCD_CAM_INT_MAP</name>
              <description>this register used to map lcd_cam interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S0_INT_MAP</name>
          <description>i2s0 interrupt configuration register</description>
          <addressOffset>0x864</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>I2S0_INT_MAP</name>
              <description>this register used to map i2s0 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S1_INT_MAP</name>
          <description>i2s1 interrupt configuration register</description>
          <addressOffset>0x868</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>I2S1_INT_MAP</name>
              <description>this register used to map i2s1 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_INTR_MAP</name>
          <description>uart interrupt configuration register</description>
          <addressOffset>0x86C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>UART_INTR_MAP</name>
              <description>this register used to map uart interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART1_INTR_MAP</name>
          <description>uart1 interrupt configuration register</description>
          <addressOffset>0x870</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>UART1_INTR_MAP</name>
              <description>this register used to map uart1 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART2_INTR_MAP</name>
          <description>uart2 interrupt configuration register</description>
          <addressOffset>0x874</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>UART2_INTR_MAP</name>
              <description>this register used to map uart2 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_HOST_INTERRUPT_MAP</name>
          <description>sdio_host interrupt configuration register</description>
          <addressOffset>0x878</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SDIO_HOST_INTERRUPT_MAP</name>
              <description>this register used to map sdio_host interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM0_INTR_MAP</name>
          <description>pwm0 interrupt configuration register</description>
          <addressOffset>0x87C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PWM0_INTR_MAP</name>
              <description>this register used to map pwm0 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM1_INTR_MAP</name>
          <description>pwm1 interrupt configuration register</description>
          <addressOffset>0x880</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PWM1_INTR_MAP</name>
              <description>this register used to map pwm1 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM2_INTR_MAP</name>
          <description>pwm2 interrupt configuration register</description>
          <addressOffset>0x884</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PWM2_INTR_MAP</name>
              <description>this register used to map pwm2 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM3_INTR_MAP</name>
          <description>pwm3 interrupt configuration register</description>
          <addressOffset>0x888</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PWM3_INTR_MAP</name>
              <description>this register used to map pwm3 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEDC_INT_MAP</name>
          <description>ledc interrupt configuration register</description>
          <addressOffset>0x88C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>LEDC_INT_MAP</name>
              <description>this register used to map ledc interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
