esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
        <register>
          <name>EFUSE_INT_MAP</name>
          <description>efuse interrupt configuration register</description>
          <addressOffset>0x890</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>EFUSE_INT_MAP</name>
              <description>this register used to map efuse interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_INT_MAP</name>
          <description>can interrupt configuration register</description>
          <addressOffset>0x894</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CAN_INT_MAP</name>
              <description>this register used to map can interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_INTR_MAP</name>
          <description>usb interrupt configuration register</description>
          <addressOffset>0x898</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>USB_INTR_MAP</name>
              <description>this register used to map usb interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_CORE_INTR_MAP</name>
          <description>rtc_core interrupt configuration register</description>
          <addressOffset>0x89C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>RTC_CORE_INTR_MAP</name>
              <description>this register used to map rtc_core interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RMT_INTR_MAP</name>
          <description>rmt interrupt configuration register</description>
          <addressOffset>0x8A0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>RMT_INTR_MAP</name>
              <description>this register used to map rmt interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNT_INTR_MAP</name>
          <description>pcnt interrupt configuration register</description>
          <addressOffset>0x8A4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PCNT_INTR_MAP</name>
              <description>this register used to map pcnt interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_EXT0_INTR_MAP</name>
          <description>i2c_ext0 interrupt configuration register</description>
          <addressOffset>0x8A8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>I2C_EXT0_INTR_MAP</name>
              <description>this register used to map i2c_ext0 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_EXT1_INTR_MAP</name>
          <description>i2c_ext1 interrupt configuration register</description>
          <addressOffset>0x8AC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>I2C_EXT1_INTR_MAP</name>
              <description>this register used to map i2c_ext1 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2_DMA_INT_MAP</name>
          <description>spi2_dma interrupt configuration register</description>
          <addressOffset>0x8B0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SPI2_DMA_INT_MAP</name>
              <description>this register used to map spi2_dma interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI3_DMA_INT_MAP</name>
          <description>spi3_dma interrupt configuration register</description>
          <addressOffset>0x8B4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SPI3_DMA_INT_MAP</name>
              <description>this register used to map spi3_dma interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI4_DMA_INT_MAP</name>
          <description>spi4_dma interrupt configuration register</description>
          <addressOffset>0x8B8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SPI4_DMA_INT_MAP</name>
              <description>this register used to map spi4_dma interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG_INT_MAP</name>
          <description>wdg interrupt configuration register</description>
          <addressOffset>0x8BC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>WDG_INT_MAP</name>
              <description>this register used to map wdg interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_INT1_MAP</name>
          <description>timer_int1 interrupt configuration register</description>
          <addressOffset>0x8C0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>TIMER_INT1_MAP</name>
              <description>this register used to map timer_int1 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_INT2_MAP</name>
          <description>timer_int2 interrupt configuration register</description>
          <addressOffset>0x8C4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>TIMER_INT2_MAP</name>
              <description>this register used to map timer_int2 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TG_T0_INT_MAP</name>
          <description>tg_t0 interrupt configuration register</description>
          <addressOffset>0x8C8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>TG_T0_INT_MAP</name>
              <description>this register used to map tg_t0 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TG_T1_INT_MAP</name>
          <description>tg_t1 interrupt configuration register</description>
          <addressOffset>0x8CC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>TG_T1_INT_MAP</name>
              <description>this register used to map tg_t1 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TG_WDT_INT_MAP</name>
          <description>tg_wdt interrupt configuration register</description>
          <addressOffset>0x8D0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>TG_WDT_INT_MAP</name>
              <description>this register used to map rg_wdt interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TG1_T0_INT_MAP</name>
          <description>tg1_t0 interrupt configuration register</description>
          <addressOffset>0x8D4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>TG1_T0_INT_MAP</name>
              <description>this register used to map tg1_t0 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TG1_T1_INT_MAP</name>
          <description>tg1_t1 interrupt configuration register</description>
          <addressOffset>0x8D8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>TG1_T1_INT_MAP</name>
              <description>this register used to map tg1_t1 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TG1_WDT_INT_MAP</name>
          <description>tg1_wdt interrupt configuration register</description>
          <addressOffset>0x8DC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>TG1_WDT_INT_MAP</name>
              <description>this register used to map tg1_wdt interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_IA_INT_MAP</name>
          <description>cache_ia interrupt configuration register</description>
          <addressOffset>0x8E0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CACHE_IA_INT_MAP</name>
              <description>this register used to map cache_ia interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTIMER_TARGET0_INT_MAP</name>
          <description>systimer_target0 interrupt configuration register</description>
          <addressOffset>0x8E4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SYSTIMER_TARGET0_INT_MAP</name>
              <description>this register used to map systimer_target0 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTIMER_TARGET1_INT_MAP</name>
          <description>systimer_target1 interrupt configuration register</description>
          <addressOffset>0x8E8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SYSTIMER_TARGET1_INT_MAP</name>
              <description>this register used to map systimer_target1 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTIMER_TARGET2_INT_MAP</name>
          <description>systimer_target2 interrupt configuration register</description>
          <addressOffset>0x8EC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SYSTIMER_TARGET2_INT_MAP</name>
              <description>this register used to map systimer_target2 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_REJECT_INTR_MAP</name>
          <description>spi_mem_reject interrupt configuration register</description>
          <addressOffset>0x8F0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_REJECT_INTR_MAP</name>
              <description>this register used to map spi_mem_reject interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCACHE_PRELOAD_INT_MAP</name>
          <description>dcache_prelaod interrupt configuration register</description>
          <addressOffset>0x8F4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>DCACHE_PRELOAD_INT_MAP</name>
              <description>this register used to map dcache_prelaod interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE_PRELOAD_INT_MAP</name>
          <description>icache_preload interrupt configuration register</description>
          <addressOffset>0x8F8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>ICACHE_PRELOAD_INT_MAP</name>
              <description>this register used to map icache_preload interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCACHE_SYNC_INT_MAP</name>
          <description>dcache_sync interrupt configuration register</description>
          <addressOffset>0x8FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>DCACHE_SYNC_INT_MAP</name>
              <description>this register used to map dcache_sync interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE_SYNC_INT_MAP</name>
          <description>icache_sync interrupt configuration register</description>
          <addressOffset>0x900</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>ICACHE_SYNC_INT_MAP</name>
              <description>this register used to map icache_sync interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_ADC_INT_MAP</name>
          <description>apb_adc interrupt configuration register</description>
          <addressOffset>0x904</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APB_ADC_INT_MAP</name>
              <description>this register used to map apb_adc interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_IN_CH0_INT_MAP</name>
          <description>dma_in_ch0 interrupt configuration register</description>
          <addressOffset>0x908</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>DMA_IN_CH0_INT_MAP</name>
              <description>this register used to map dma_in_ch0 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_IN_CH1_INT_MAP</name>
          <description>dma_in_ch1 interrupt configuration register</description>
          <addressOffset>0x90C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>DMA_IN_CH1_INT_MAP</name>
              <description>this register used to map dma_in_ch1 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_IN_CH2_INT_MAP</name>
          <description>dma_in_ch2 interrupt configuration register</description>
          <addressOffset>0x910</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>DMA_IN_CH2_INT_MAP</name>
              <description>this register used to map dma_in_ch2 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_IN_CH3_INT_MAP</name>
          <description>dma_in_ch3 interrupt configuration register</description>
          <addressOffset>0x914</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>DMA_IN_CH3_INT_MAP</name>
              <description>this register used to map dma_in_ch3 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_IN_CH4_INT_MAP</name>
          <description>dma_in_ch4 interrupt configuration register</description>
          <addressOffset>0x918</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>DMA_IN_CH4_INT_MAP</name>
              <description>this register used to map dma_in_ch4 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_OUT_CH0_INT_MAP</name>
          <description>dma_out_ch0 interrupt configuration register</description>
          <addressOffset>0x91C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>DMA_OUT_CH0_INT_MAP</name>
              <description>this register used to map dma_out_ch0 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_OUT_CH1_INT_MAP</name>
          <description>dma_out_ch1 interrupt configuration register</description>
          <addressOffset>0x920</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>DMA_OUT_CH1_INT_MAP</name>
              <description>this register used to map dma_out_ch1 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
