esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
        <register>
          <name>DMA_OUT_CH2_INT_MAP</name>
          <description>dma_out_ch2 interrupt configuration register</description>
          <addressOffset>0x924</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>DMA_OUT_CH2_INT_MAP</name>
              <description>this register used to map dma_out_ch2 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_OUT_CH3_INT_MAP</name>
          <description>dma_out_ch3 interrupt configuration register</description>
          <addressOffset>0x928</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>DMA_OUT_CH3_INT_MAP</name>
              <description>this register used to map dma_out_ch3 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_OUT_CH4_INT_MAP</name>
          <description>dma_out_ch4 interrupt configuration register</description>
          <addressOffset>0x92C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>DMA_OUT_CH4_INT_MAP</name>
              <description>this register used to map dma_out_ch4 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSA_INT_MAP</name>
          <description>rsa interrupt configuration register</description>
          <addressOffset>0x930</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>RSA_INT_MAP</name>
              <description>this register used to map rsa interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_INT_MAP</name>
          <description>aes interrupt configuration register</description>
          <addressOffset>0x934</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>AES_INT_MAP</name>
              <description>this register used to map aes interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_INT_MAP</name>
          <description>sha interrupt configuration register</description>
          <addressOffset>0x938</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SHA_INT_MAP</name>
              <description>this register used to map sha interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_INTR_FROM_CPU_0_MAP</name>
          <description>cpu_intr_from_cpu_0 interrupt configuration register</description>
          <addressOffset>0x93C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CPU_INTR_FROM_CPU_0_MAP</name>
              <description>this register used to map cpu_intr_from_cpu_0 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_INTR_FROM_CPU_1_MAP</name>
          <description>cpu_intr_from_cpu_1 interrupt configuration register</description>
          <addressOffset>0x940</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CPU_INTR_FROM_CPU_1_MAP</name>
              <description>this register used to map cpu_intr_from_cpu_1 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_INTR_FROM_CPU_2_MAP</name>
          <description>cpu_intr_from_cpu_2 interrupt configuration register</description>
          <addressOffset>0x944</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CPU_INTR_FROM_CPU_2_MAP</name>
              <description>this register used to map cpu_intr_from_cpu_2 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_INTR_FROM_CPU_3_MAP</name>
          <description>cpu_intr_from_cpu_3 interrupt configuration register</description>
          <addressOffset>0x948</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CPU_INTR_FROM_CPU_3_MAP</name>
              <description>this register used to map cpu_intr_from_cpu_3 interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIST_DEBUG_INTR_MAP</name>
          <description>assist_debug interrupt configuration register</description>
          <addressOffset>0x94C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>ASSIST_DEBUG_INTR_MAP</name>
              <description>this register used to map assist_debug interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP</name>
          <description>dma_pms_monitor_violatile interrupt configuration register</description>
          <addressOffset>0x950</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP</name>
              <description>this register used to map dma_pms_monitor_violatile interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP</name>
          <description>core0_IRam0_pms_monitor_violatile interrupt configuration register</description>
          <addressOffset>0x954</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP</name>
              <description>this register used to map core0_IRam0_pms_monitor_violatile interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP</name>
          <description>core0_DRam0_pms_monitor_violatile interrupt configuration register</description>
          <addressOffset>0x958</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP</name>
              <description>this register used to map core0_DRam0_pms_monitor_violatile interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP</name>
          <description>core0_PIF_pms_monitor_violatile interrupt configuration register</description>
          <addressOffset>0x95C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP</name>
              <description>this register used to map core0_PIF_pms_monitor_violatile interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP</name>
          <description>core0_PIF_pms_monitor_violatile_size interrupt configuration register</description>
          <addressOffset>0x960</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP</name>
              <description>this register used to map core0_PIF_pms_monitor_violatile_size interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP</name>
          <description>core1_IRam0_pms_monitor_violatile interrupt configuration register</description>
          <addressOffset>0x964</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CORE_1_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP</name>
              <description>this register used to map core1_IRam0_pms_monitor_violatile interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP</name>
          <description>core1_DRam0_pms_monitor_violatile interrupt configuration register</description>
          <addressOffset>0x968</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CORE_1_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP</name>
              <description>this register used to map core1_DRam0_pms_monitor_violatile interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_MAP</name>
          <description>core1_PIF_pms_monitor_violatile interrupt configuration register</description>
          <addressOffset>0x96C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_MAP</name>
              <description>this register used to map core1_PIF_pms_monitor_violatile interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP</name>
          <description>core1_PIF_pms_monitor_violatile_size interrupt configuration register</description>
          <addressOffset>0x970</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP</name>
              <description>this register used to map core1_PIF_pms_monitor_violatile_size interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_PMS_VIOLATE_INTR_MAP</name>
          <description>backup_pms_monitor_violatile interrupt configuration register</description>
          <addressOffset>0x974</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>BACKUP_PMS_VIOLATE_INTR_MAP</name>
              <description>this register used to map backup_pms_monitor_violatile interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_CORE0_ACS_INT_MAP</name>
          <description>cache_core0_acs interrupt configuration register</description>
          <addressOffset>0x978</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CACHE_CORE0_ACS_INT_MAP</name>
              <description>this register used to map cache_core0_acs interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_CORE1_ACS_INT_MAP</name>
          <description>cache_core1_acs interrupt configuration register</description>
          <addressOffset>0x97C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>CACHE_CORE1_ACS_INT_MAP</name>
              <description>this register used to map cache_core1_acs interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DEVICE_INT_MAP</name>
          <description>usb_device interrupt configuration register</description>
          <addressOffset>0x980</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>USB_DEVICE_INT_MAP</name>
              <description>this register used to map usb_device interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERI_BACKUP_INT_MAP</name>
          <description>peri_backup interrupt configuration register</description>
          <addressOffset>0x984</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PERI_BACKUP_INT_MAP</name>
              <description>this register used to map peri_backup interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_EXTMEM_REJECT_INT_MAP</name>
          <description>dma_extmem_reject interrupt configuration register</description>
          <addressOffset>0x988</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>DMA_EXTMEM_REJECT_INT_MAP</name>
              <description>this register used to map dma_extmem_reject interrupt to one of core1's external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_INTR_STATUS_0</name>
          <description>interrupt status register</description>
          <addressOffset>0x98C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTR_STATUS_0</name>
              <description>this register store the status of the first 32 interrupt source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_INTR_STATUS_1</name>
          <description>interrupt status register</description>
          <addressOffset>0x990</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTR_STATUS_1</name>
              <description>this register store the status of the first 32 interrupt source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_INTR_STATUS_2</name>
          <description>interrupt status register</description>
          <addressOffset>0x994</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTR_STATUS_2</name>
              <description>this register store the status of the first 32 interrupt source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_INTR_STATUS_3</name>
          <description>interrupt status register</description>
          <addressOffset>0x998</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTR_STATUS_3</name>
              <description>this register store the status of the first 32 interrupt source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>clock gate register</description>
          <addressOffset>0x99C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>REG_CLK_EN</name>
              <description>this register uesd to control clock-gating interupt martrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>version register</description>
          <addressOffset>0xFFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x02012300</resetValue>
          <fields>
            <field>
              <name>INTERRUPT_DATE</name>
              <description>version register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
