esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
        <register>
          <name>LCD_MISC</name>
          <description>LCD MISC configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000022</resetValue>
          <fields>
            <field>
              <name>LCD_AFIFO_THRESHOLD_NUM</name>
              <description>Set the threshold for Async Tx FIFO full event.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_VFK_CYCLELEN</name>
              <description>Configure the setup cycles in LCD non-RGB mode. Setup cycles expected = this value + 1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_VBK_CYCLELEN</name>
              <description>Configure the hold time cycles in LCD non-RGB mode. Hold cycles expected = this value + 1. %Configure the cycles for vertical back blank region in LCD RGB mode, the cycles = this value + 1. Or configure the hold time cycles in LCD non-RGB mode, the cycles = this value + 1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_NEXT_FRAME_EN</name>
              <description>1: Send the next frame data when the current frame is sent out. 0: LCD stops when the current frame is sent out.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_BK_EN</name>
              <description>1: Enable blank region when LCD sends data out. 0: No blank region.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_AFIFO_RESET</name>
              <description>Async Tx FIFO reset signal.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LCD_CD_DATA_SET</name>
              <description>1: LCD_CD = !LCD_CAM_LCD_CD_IDLE_EDGE when LCD is in DOUT phase. 0: LCD_CD = LCD_CAM_LCD_CD_IDLE_EDGE.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CD_DUMMY_SET</name>
              <description>1: LCD_CD = !LCD_CAM_LCD_CD_IDLE_EDGE when LCD is in DUMMY phase. 0: LCD_CD = LCD_CAM_LCD_CD_IDLE_EDGE.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CD_CMD_SET</name>
              <description>1: LCD_CD = !LCD_CAM_LCD_CD_IDLE_EDGE when LCD is in CMD phase. 0: LCD_CD = LCD_CAM_LCD_CD_IDLE_EDGE.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_CD_IDLE_EDGE</name>
              <description>The default value of LCD_CD.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD_CTRL</name>
          <description>LCD signal configuration register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LCD_HB_FRONT</name>
              <description>It is the horizontal blank front porch of a frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_VA_HEIGHT</name>
              <description>It is the vertical active height of a frame.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_VT_HEIGHT</name>
              <description>It is the vertical total height of a frame.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_RGB_MODE_EN</name>
              <description>1: Enable RGB mode, and input VSYNC, HSYNC, and DE signals. 0: Disable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD_CTRL1</name>
          <description>LCD signal configuration register 1</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LCD_VB_FRONT</name>
              <description>It is the vertical blank front porch of a frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_HA_WIDTH</name>
              <description>It is the horizontal active width of a frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_HT_WIDTH</name>
              <description>It is the horizontal total width of a frame.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD_CTRL2</name>
          <description>LCD signal configuration register 2</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LCD_VSYNC_WIDTH</name>
              <description>It is the width of LCD_VSYNC active pulse in a line.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_VSYNC_IDLE_POL</name>
              <description>It is the idle value of LCD_VSYNC.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_DE_IDLE_POL</name>
              <description>It is the idle value of LCD_DE.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_HS_BLANK_EN</name>
              <description>1: The pulse of LCD_HSYNC is out in vertical blanking lines in RGB mode. 0: LCD_HSYNC pulse is valid only in active region lines in RGB mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_HSYNC_WIDTH</name>
              <description>It is the width of LCD_HSYNC active pulse in a line.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_HSYNC_IDLE_POL</name>
              <description>It is the idle value of LCD_HSYNC.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_HSYNC_POSITION</name>
              <description>It is the position of LCD_HSYNC active pulse in a line.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD_CMD_VAL</name>
          <description>LCD command value configuration register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LCD_CMD_VALUE</name>
              <description>The LCD write command value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD_DLY_MODE</name>
          <description>LCD signal delay configuration register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LCD_CD_MODE</name>
              <description>The output LCD_CD is delayed by module clock LCD_CLK. 0: output without delay. 1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_DE_MODE</name>
              <description>The output LCD_DE is delayed by module clock LCD_CLK. 0: output without delay. 1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_HSYNC_MODE</name>
              <description>The output LCD_HSYNC is delayed by module clock LCD_CLK. 0: output without delay. 1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_VSYNC_MODE</name>
              <description>The output LCD_VSYNC is delayed by module clock LCD_CLK. 0: output without delay. 1: delayed by the rising edge of LCD_CLK. 2: delay by the falling edge of LCD_CLK.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD_DATA_DOUT_MODE</name>
          <description>LCD data delay configuration register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>0x2</dimIncrement>
              <dimIndex>0-15</dimIndex>
              <name>DOUT%s_MODE</name>
              <description>The output data bit %s is delayed by module clock LCD_CLK. 0: output without delay. 1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>DelayMode</name>
                <enumeratedValue>
                  <name>None</name>
                  <description>Output without delay</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RaisingEdge</name>
                  <description>Delayed by the rising edge of LCD_CLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FallingEdge</name>
                  <description>Delayed by the falling edge of LCD_CLK</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LC_DMA_INT_ENA</name>
          <description>LCD_CAM GDMA interrupt enable register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LCD_VSYNC_INT_ENA</name>
              <description>The enable bit for LCD_CAM_LCD_VSYNC_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD_TRANS_DONE_INT_ENA</name>
              <description>The enable bit for LCD_CAM_LCD_TRANS_DONE_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_VSYNC_INT_ENA</name>
              <description>The enable bit for LCD_CAM_CAM_VSYNC_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_HS_INT_ENA</name>
              <description>The enable bit for LCD_CAM_CAM_HS_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LC_DMA_INT_RAW</name>
          <description>LCD_CAM GDMA raw interrupt status register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LCD_VSYNC_INT_RAW</name>
              <description>The raw bit for LCD_CAM_LCD_VSYNC_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LCD_TRANS_DONE_INT_RAW</name>
              <description>The raw bit for LCD_CAM_LCD_TRANS_DONE_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAM_VSYNC_INT_RAW</name>
              <description>The raw bit for LCD_CAM_CAM_VSYNC_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAM_HS_INT_RAW</name>
              <description>The raw bit for LCD_CAM_CAM_HS_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LC_DMA_INT_ST</name>
          <description>LCD_CAM GDMA masked interrupt status register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LCD_VSYNC_INT_ST</name>
              <description>The status bit for LCD_CAM_LCD_VSYNC_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LCD_TRANS_DONE_INT_ST</name>
              <description>The status bit for LCD_CAM_LCD_TRANS_DONE_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAM_VSYNC_INT_ST</name>
              <description>The status bit for LCD_CAM_CAM_VSYNC_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAM_HS_INT_ST</name>
              <description>The status bit for LCD_CAM_CAM_HS_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LC_DMA_INT_CLR</name>
          <description>LCD_CAM GDMA interrupt clear register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LCD_VSYNC_INT_CLR</name>
              <description>The clear bit for LCD_CAM_LCD_VSYNC_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LCD_TRANS_DONE_INT_CLR</name>
              <description>The clear bit for LCD_CAM_LCD_TRANS_DONE_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CAM_VSYNC_INT_CLR</name>
              <description>The clear bit for LCD_CAM_CAM_VSYNC_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CAM_HS_INT_CLR</name>
              <description>The clear bit for LCD_CAM_CAM_HS_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LC_REG_DATE</name>
          <description>Version control register</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x02003020</resetValue>
          <fields>
            <field>
              <name>LC_DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
