esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
1'h0: APB bus is using the ram.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FILTER_EN</name>
              <description>This is the receive filter's enable bit for CHANNEL%s.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FILTER_THRES</name>
              <description>Ignores the input pulse when its width is smaller than this register value in APB clock periods (in receive mode).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_RX_WRAP_EN</name>
              <description>This is the channel %s enable bit for wraparound mode: it will resume receiving at the start when the data to be received is more than its memory size.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFIFO_RST</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CONF_UPDATE</name>
              <description>synchronization bit for CHANNEL%s</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%s_TX_STATUS</name>
          <description>Channel %s status register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MEM_RADDR_EX</name>
              <description>This register records the memory address offset when transmitter of CHANNEL%s is using the RAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APB_MEM_WADDR</name>
              <description>This register records the memory address offset when writes RAM over APB bus.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE</name>
              <description>This register records the FSM status of CHANNEL%s.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_EMPTY</name>
              <description>This status bit will be set when the data to be set is more than memory size and the wraparound mode is disabled.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APB_MEM_WR_ERR</name>
              <description>This status bit will be set if the offset address out of memory size when writes via APB bus.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%s_RX_STATUS</name>
          <description>Channel %s status register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x000600C0</resetValue>
          <fields>
            <field>
              <name>MEM_WADDR_EX</name>
              <description>This register records the memory address offset when receiver of CHANNEL%s is using the RAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APB_MEM_RADDR</name>
              <description>This register records the memory address offset when reads RAM over APB bus.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE</name>
              <description>This register records the FSM status of CHANNEL%s.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_OWNER_ERR</name>
              <description>This status bit will be set when the ownership of memory block is wrong.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_FULL</name>
              <description>This status bit will be set if the receiver receives more data than the memory size.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APB_MEM_RD_ERR</name>
              <description>This status bit will be set if the offset address out of memory size when reads via APB bus.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Raw interrupt status</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_END</name>
              <description>The interrupt raw bit for CHANNEL%s. Triggered when transmission done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_ERR</name>
              <description>The interrupt raw bit for CHANNEL%s. Triggered when error occurs.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_THR_EVENT</name>
              <description>The interrupt raw bit for CHANNEL%s. Triggered when transmitter sent more data than configured value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_LOOP</name>
              <description>The interrupt raw bit for CHANNEL%s. Triggered when the loop count reaches the configured threshold value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>4-7</dimIndex>
              <name>CH%s_RX_END</name>
              <description>The interrupt raw bit for CHANNEL4. Triggered when reception done.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>4-7</dimIndex>
              <name>CH%s_RX_ERR</name>
              <description>The interrupt raw bit for CHANNEL4. Triggered when error occurs.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>4-7</dimIndex>
              <name>CH%s_RX_THR_EVENT</name>
              <description>The interrupt raw bit for CHANNEL4. Triggered when receiver receive more data than configured value.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CH3_DMA_ACCESS_FAIL</name>
              <description>The interrupt raw bit for CHANNEL3. Triggered when dma accessing CHANNEL3 fails.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CH7_DMA_ACCESS_FAIL</name>
              <description>The interrupt raw bit for CHANNEL7. Triggered when dma accessing CHANNEL7 fails.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Masked interrupt status</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_END</name>
              <description>The masked interrupt status bit for CH%s_TX_END_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_ERR</name>
              <description>The masked interrupt status bit for CH%s_ERR_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_THR_EVENT</name>
              <description>The masked interrupt status bit for CH%s_TX_THR_EVENT_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_LOOP</name>
              <description>The masked interrupt status bit for CH%s_TX_LOOP_INT.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>4-7</dimIndex>
              <name>CH%s_RX_END</name>
              <description>The masked interrupt status bit for CH4_RX_END_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>4-7</dimIndex>
              <name>CH%s_RX_ERR</name>
              <description>The masked interrupt status bit for CH4_ERR_INT.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>4-7</dimIndex>
              <name>CH%s_RX_THR_EVENT</name>
              <description>The masked interrupt status bit for CH4_RX_THR_EVENT_INT.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_CH3_DMA_ACCESS_FAIL</name>
              <description>The masked interrupt status bit for  CH3_DMA_ACCESS_FAIL_INT.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_CH7_DMA_ACCESS_FAIL</name>
              <description>The masked interrupt status bit for  CH7_DMA_ACCESS_FAIL_INT.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable bits</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_END</name>
              <description>The interrupt enable bit for CH%s_TX_END_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_ERR</name>
              <description>The interrupt enable bit for CH%s_ERR_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_THR_EVENT</name>
              <description>The interrupt enable bit for CH%s_TX_THR_EVENT_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_LOOP</name>
              <description>The interrupt enable bit for CH%s_TX_LOOP_INT.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>4-7</dimIndex>
              <name>CH%s_RX_END</name>
              <description>The interrupt enable bit for CH4_RX_END_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>4-7</dimIndex>
              <name>CH%s_RX_ERR</name>
              <description>The interrupt enable bit for CH4_ERR_INT.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>4-7</dimIndex>
              <name>CH%s_RX_THR_EVENT</name>
              <description>The interrupt enable bit for CH4_RX_THR_EVENT_INT.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CH3_DMA_ACCESS_FAIL</name>
              <description>The interrupt enable bit for CH3_DMA_ACCESS_FAIL_INT.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CH7_DMA_ACCESS_FAIL</name>
              <description>The interrupt enable bit for CH7_DMA_ACCESS_FAIL_INT.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear bits</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_END</name>
              <description>Set this bit to clear theCH%s_TX_END_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_ERR</name>
              <description>Set this bit to clear theCH%s_ERR_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_THR_EVENT</name>
              <description>Set this bit to clear theCH%s_TX_THR_EVENT_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_LOOP</name>
              <description>Set this bit to clear theCH%s_TX_LOOP_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>4-7</dimIndex>
              <name>CH%s_RX_END</name>
              <description>Set this bit to clear theCH4_RX_END_INT interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>4-7</dimIndex>
              <name>CH%s_RX_ERR</name>
              <description>Set this bit to clear theCH4_ERR_INT interrupt.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>4-7</dimIndex>
              <name>CH%s_RX_THR_EVENT</name>
              <description>Set this bit to clear theCH4_RX_THR_EVENT_INT interrupt.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_CH3_DMA_ACCESS_FAIL</name>
              <description>Set this bit to clear the CH3_DMA_ACCESS_FAIL_INT interrupt.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_CH7_DMA_ACCESS_FAIL</name>
              <description>Set this bit to clear the CH7_DMA_ACCESS_FAIL_INT interrupt.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%sCARRIER_DUTY</name>
          <description>Channel %s duty cycle configuration register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400040</resetValue>
          <fields>
            <field>
              <name>CARRIER_LOW</name>
              <description>This register is used to configure carrier wave 's low level clock period for CHANNEL%s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_HIGH</name>
              <description>This register is used to configure carrier wave 's high level clock period for CHANNEL%s.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%s_RX_CARRIER_RM</name>
          <description>Channel %s carrier remove register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CARRIER_LOW_THRES</name>
              <description>The low level period in a carrier modulation mode is (REG_RMT_REG_CARRIER_LOW_THRES_CH%s + 1) for channel %s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_HIGH_THRES</name>
              <description>The high level period in a carrier modulation mode is (REG_RMT_REG_CARRIER_HIGH_THRES_CH%s + 1) for channel %s.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
