esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
        <register>
          <name>SAR_POWER_XPD_SAR</name>
          <description>configure power of saradc</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FORCE_XPD_SAR</name>
              <description>force power on/off saradc</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARCLK_EN</name>
              <description>no public</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR1</name>
          <description>configure i2c slave address</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_I2C_SLAVE_ADDR1</name>
              <description>configure i2c slave address1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_SLAVE_ADDR0</name>
              <description>configure i2c slave address0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SARADC_MEAS_STATUS</name>
              <description>no public</description>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR2</name>
          <description>configure i2c slave address</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_I2C_SLAVE_ADDR3</name>
              <description>configure i2c slave address3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_SLAVE_ADDR2</name>
              <description>configure i2c slave address2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR3</name>
          <description>configure i2c slave address</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_I2C_SLAVE_ADDR5</name>
              <description>configure i2c slave address5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_SLAVE_ADDR4</name>
              <description>configure i2c slave address4</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR4</name>
          <description>configure i2c slave address</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_I2C_SLAVE_ADDR7</name>
              <description>configure i2c slave address7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_SLAVE_ADDR6</name>
              <description>configure i2c slave address6</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TSENS_CTRL</name>
          <description>configure tsens controller</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00019000</resetValue>
          <fields>
            <field>
              <name>SAR_TSENS_OUT</name>
              <description>temperature sensor data out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TSENS_READY</name>
              <description>indicate temperature sensor out ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TSENS_INT_EN</name>
              <description>enable temperature sensor to send out interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_TSENS_IN_INV</name>
              <description>invert temperature sensor data</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_TSENS_CLK_DIV</name>
              <description>temperature sensor clock divider</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_TSENS_POWER_UP</name>
              <description>temperature sensor power up</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_TSENS_POWER_UP_FORCE</name>
              <description>1: dump out &amp; power up controlled by SW 0: by FSM</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_TSENS_DUMP_OUT</name>
              <description>temperature sensor dump out only active when reg_tsens_power_up_force = 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TSENS_CTRL2</name>
          <description>configure tsens controller</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00004002</resetValue>
          <fields>
            <field>
              <name>SAR_TSENS_XPD_WAIT</name>
              <description>no public</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_TSENS_XPD_FORCE</name>
              <description>no public</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_TSENS_CLK_INV</name>
              <description>no public</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_I2C_CTRL</name>
          <description>configure rtc i2c controller by sw</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_I2C_CTRL</name>
              <description>I2C control data  only active when reg_sar_i2c_start_force = 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_START</name>
              <description>start I2C  only active when reg_sar_i2c_start_force = 1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_START_FORCE</name>
              <description>1: I2C started by SW  0: I2C started by FSM</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_CONF</name>
          <description>configure touch controller</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFF07FFF</resetValue>
          <fields>
            <field>
              <name>SAR_TOUCH_OUTEN</name>
              <description>touch controller output enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_TOUCH_STATUS_CLR</name>
              <description>clear all touch active status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_DATA_SEL</name>
              <description>3: smooth data 2: baseline 1,0: raw_data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_TOUCH_DENOISE_END</name>
              <description>touch_denoise_done</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_UNIT_END</name>
              <description>touch_unit_done</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_APPROACH_PAD2</name>
              <description>indicate which pad is approach pad2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_TOUCH_APPROACH_PAD1</name>
              <description>indicate which pad is approach pad1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_TOUCH_APPROACH_PAD0</name>
              <description>indicate which pad is approach pad0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_DENOISE</name>
          <description>configure touch controller</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>configure touch controller</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES1</name>
          <description>configure touch thres of touch pad</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_OUT_TH1</name>
              <description>Finger threshold for touch pad 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES2</name>
          <description>configure touch thres of touch pad</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_OUT_TH2</name>
              <description>Finger threshold for touch pad 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES3</name>
          <description>configure touch thres of touch pad</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_OUT_TH3</name>
              <description>Finger threshold for touch pad 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES4</name>
          <description>configure touch thres of touch pad</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_OUT_TH4</name>
              <description>Finger threshold for touch pad 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES5</name>
          <description>configure touch thres of touch pad</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_OUT_TH5</name>
              <description>Finger threshold for touch pad 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES6</name>
          <description>configure touch thres of touch pad</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_OUT_TH6</name>
              <description>Finger threshold for touch pad 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES7</name>
          <description>configure touch thres of touch pad</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_OUT_TH7</name>
              <description>Finger threshold for touch pad 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES8</name>
          <description>configure touch thres of touch pad</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_OUT_TH8</name>
              <description>Finger threshold for touch pad 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES9</name>
          <description>configure touch thres of touch pad</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_OUT_TH9</name>
              <description>Finger threshold for touch pad 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES10</name>
          <description>configure touch thres of touch pad</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_OUT_TH10</name>
              <description>Finger threshold for touch pad 10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES11</name>
          <description>configure touch thres of touch pad</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_OUT_TH11</name>
              <description>Finger threshold for touch pad 11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES12</name>
          <description>configure touch thres of touch pad</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_OUT_TH12</name>
              <description>Finger threshold for touch pad 12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES13</name>
          <description>configure touch thres of touch pad</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_OUT_TH13</name>
              <description>Finger threshold for touch pad 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES14</name>
          <description>configure touch thres of touch pad</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_OUT_TH14</name>
              <description>Finger threshold for touch pad 14</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_CHN_ST</name>
          <description>Get touch channel status</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_PAD_ACTIVE</name>
              <description>touch active status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_CHANNEL_CLR</name>
              <description>Clear touch channel</description>
              <bitOffset>15</bitOffset>
              <bitWidth>15</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_MEAS_DONE</name>
              <description>get touch meas done</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS0</name>
          <description>get touch scan status</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_SCAN_CURR</name>
              <description>current sample channel</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS1</name>
          <description>touch channel status of touch pad 1</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_PAD1_DATA</name>
              <description>touch data debounce of touch pad 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_PAD1_DEBOUNCE</name>
              <description>touch current debounce of touch pad 1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS2</name>
          <description>touch channel status of touch pad 2</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_PAD2_DATA</name>
              <description>touch data debounce of touch pad 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_PAD2_DEBOUNCE</name>
              <description>touch current debounce of touch pad 2</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS3</name>
          <description>touch channel status of touch pad 3</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_PAD3_DATA</name>
              <description>touch data debounce of touch pad 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_PAD3_DEBOUNCE</name>
              <description>touch current debounce of touch pad 3</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
