esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SENSITIVE</name>
      <description>SENSITIVE Peripheral</description>
      <groupName>SENSITIVE</groupName>
      <baseAddress>0x600C1000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x314</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CACHE_DATAARRAY_CONNECT_0</name>
          <description>Cache data array configuration register 0.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_DATAARRAY_CONNECT_LOCK</name>
              <description>Set 1 to lock cache data array registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_DATAARRAY_CONNECT_1</name>
          <description>Cache data array configuration register 1.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x000000FF</resetValue>
          <fields>
            <field>
              <name>CACHE_DATAARRAY_CONNECT_FLATTEN</name>
              <description>Cache data array connection configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_PERIPHERAL_ACCESS_0</name>
          <description>APB peripheral configuration register 0.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB_PERIPHERAL_ACCESS_LOCK</name>
              <description>Set 1 to lock APB peripheral Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_PERIPHERAL_ACCESS_1</name>
          <description>APB peripheral configuration register 1.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>APB_PERIPHERAL_ACCESS_SPLIT_BURST</name>
              <description>Set 1 to support split function for AHB access to APB peripherals.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERNAL_SRAM_USAGE_0</name>
          <description>Internal SRAM configuration register 0.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTERNAL_SRAM_USAGE_LOCK</name>
              <description>Set 1 to lock internal SRAM Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERNAL_SRAM_USAGE_1</name>
          <description>Internal SRAM configuration register 1.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x000007FF</resetValue>
          <fields>
            <field>
              <name>INTERNAL_SRAM_ICACHE_USAGE</name>
              <description>Set 1 to someone bit means corresponding internal SRAM level can be accessed by icache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERNAL_SRAM_DCACHE_USAGE</name>
              <description>Set 1 to someone bit means corresponding internal SRAM level can be accessed by dcache.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERNAL_SRAM_CPU_USAGE</name>
              <description>Set 1 to someone bit means corresponding internal SRAM level can be accessed by cpu.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERNAL_SRAM_USAGE_2</name>
          <description>Internal SRAM configuration register 2.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTERNAL_SRAM_CORE0_TRACE_USAGE</name>
              <description>Set 1 to someone bit means corresponding internal SRAM level can be accessed by core0 trace bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERNAL_SRAM_CORE1_TRACE_USAGE</name>
              <description>Set 1 to someone bit means corresponding internal SRAM level can be accessed by core1 trace bus.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERNAL_SRAM_CORE0_TRACE_ALLOC</name>
              <description>Which internal SRAM bank (16KB) of 64KB can be accessed by core0 trace bus.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERNAL_SRAM_CORE1_TRACE_ALLOC</name>
              <description>Which internal SRAM bank (16KB) of 64KB can be accessed by core1 trace bus.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERNAL_SRAM_USAGE_3</name>
          <description>Internal SRAM configuration register 3.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTERNAL_SRAM_MAC_DUMP_USAGE</name>
              <description>Set 1 to someone bit means corresponding internal SRAM level can be accessed by mac dump.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERNAL_SRAM_USAGE_4</name>
          <description>Internal SRAM configuration register 4.</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTERNAL_SRAM_LOG_USAGE</name>
              <description>Set 1 to someone bit means corresponding internal SRAM level can be accessed by log bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RETENTION_DISABLE</name>
          <description>Retention configuration register.</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RETENTION_DISABLE</name>
              <description>Set 1 to disable retention function and lock disable state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_TAG_ACCESS_0</name>
          <description>Cache tag configuration register 0.</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_TAG_ACCESS_LOCK</name>
              <description>Set 1 to lock cache tag Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_TAG_ACCESS_1</name>
          <description>Cache tag configuration register 1.</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>PRO_I_TAG_RD_ACS</name>
              <description>Set 1 to enable Icache read access tag memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_I_TAG_WR_ACS</name>
              <description>Set 1 to enable Icache wrtie access tag memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_D_TAG_RD_ACS</name>
              <description>Set 1 to enable Dcache read access tag memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_D_TAG_WR_ACS</name>
              <description>Set 1 to enable Dcache wrtie access tag memory.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_MMU_ACCESS_0</name>
          <description>Cache MMU configuration register 0.</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_MMU_ACCESS_LOCK</name>
              <description>Set 1 to lock cache MMU registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_MMU_ACCESS_1</name>
          <description>Cache MMU configuration register 1.</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>PRO_MMU_RD_ACS</name>
              <description>Set 1 to enable read access MMU memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_MMU_WR_ACS</name>
              <description>Set 1 to enable write access MMU memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_SPI2_PMS_CONSTRAIN_0</name>
          <description>spi2 dma permission configuration register 0.</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_SPI2_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock spi2 dma permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_SPI2_PMS_CONSTRAIN_1</name>
          <description>spi2 dma permission configuration register 1.</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_SPI2_PMS_CONSTRAIN_SRAM_PMS_0</name>
              <description>spi2's permission(store,load) in data region0 of SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SPI2_PMS_CONSTRAIN_SRAM_PMS_1</name>
              <description>spi2's permission(store,load) in data region1 of SRAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SPI2_PMS_CONSTRAIN_SRAM_PMS_2</name>
              <description>spi2's permission(store,load) in data region2 of SRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SPI2_PMS_CONSTRAIN_SRAM_PMS_3</name>
              <description>spi2's permission(store,load) in data region3 of SRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SPI2_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_0</name>
              <description>spi2's permission(store,load) in dcache data sram block0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SPI2_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_1</name>
              <description>spi2's permission(store,load) in dcache data sram block1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_SPI3_PMS_CONSTRAIN_0</name>
          <description>spi3 dma permission configuration register 0.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_SPI3_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock spi3 dma permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_SPI3_PMS_CONSTRAIN_1</name>
          <description>spi3 dma permission configuration register 1.</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_SPI3_PMS_CONSTRAIN_SRAM_PMS_0</name>
              <description>spi3's permission(store,load) in data region0 of SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SPI3_PMS_CONSTRAIN_SRAM_PMS_1</name>
              <description>spi3's permission(store,load) in data region1 of SRAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SPI3_PMS_CONSTRAIN_SRAM_PMS_2</name>
              <description>spi3's permission(store,load) in data region2 of SRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SPI3_PMS_CONSTRAIN_SRAM_PMS_3</name>
              <description>spi3's permission(store,load) in data region3 of SRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SPI3_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_0</name>
              <description>spi3's permission(store,load) in dcache data sram block0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SPI3_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_1</name>
              <description>spi3's permission(store,load) in dcache data sram block1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_UHCI0_PMS_CONSTRAIN_0</name>
          <description>uhci0 dma permission configuration register 0.</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_UHCI0_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock uhci0 dma permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_UHCI0_PMS_CONSTRAIN_1</name>
          <description>uhci0 dma permission configuration register 1.</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_UHCI0_PMS_CONSTRAIN_SRAM_PMS_0</name>
              <description>uhci0's permission(store,load) in data region0 of SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_UHCI0_PMS_CONSTRAIN_SRAM_PMS_1</name>
              <description>uhci0's permission(store,load) in data region1 of SRAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_UHCI0_PMS_CONSTRAIN_SRAM_PMS_2</name>
              <description>uhci0's permission(store,load) in data region2 of SRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_UHCI0_PMS_CONSTRAIN_SRAM_PMS_3</name>
              <description>uhci0's permission(store,load) in data region3 of SRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_UHCI0_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_0</name>
              <description>uhci0's permission(store,load) in dcache data sram block0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_UHCI0_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_1</name>
              <description>uhci0's permission(store,load) in dcache data sram block1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_I2S0_PMS_CONSTRAIN_0</name>
          <description>i2s0 dma permission configuration register 0.</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_I2S0_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock i2s0 dma permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_I2S0_PMS_CONSTRAIN_1</name>
          <description>i2s0 dma permission configuration register 1.</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_I2S0_PMS_CONSTRAIN_SRAM_PMS_0</name>
              <description>i2s0's permission(store,load) in data region0 of SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_I2S0_PMS_CONSTRAIN_SRAM_PMS_1</name>
              <description>i2s0's permission(store,load) in data region1 of SRAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_I2S0_PMS_CONSTRAIN_SRAM_PMS_2</name>
              <description>i2s0's permission(store,load) in data region2 of SRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_I2S0_PMS_CONSTRAIN_SRAM_PMS_3</name>
              <description>i2s0's permission(store,load) in data region3 of SRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_I2S0_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_0</name>
              <description>i2s0's permission(store,load) in dcache data sram block0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_I2S0_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_1</name>
              <description>i2s0's permission(store,load) in dcache data sram block1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_I2S1_PMS_CONSTRAIN_0</name>
          <description>i2s1 dma permission configuration register 0.</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_I2S1_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock i2s1 dma permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
