esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
        <register>
          <name>CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_3</name>
          <description>sram split line configuration register 1</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_1_CATEGORY_0</name>
              <description>category0 of core_x_iram0_dram_dma_line, if the splitaddress in block0 of SRAM, configured as 0x10, else if the splitaddress below block0 of SRAM, configured as 0x11, else if splitaddress higher than block0 of SRAM, configured as 0x00</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_1_CATEGORY_1</name>
              <description>category1 of core_x_iram0_dram_dma_line, if the splitaddress in block1 of SRAM, configured as 0x10, else if the splitaddress below block1 of SRAM, configured as 0x11, else if splitaddress higher than block1 of SRAM, configured as 0x00</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_1_CATEGORY_2</name>
              <description>category2 of core_x_iram0_dram_dma_line, if the splitaddress in block2 of SRAM, configured as 0x10, else if the splitaddress below block2 of SRAM, configured as 0x11, else if splitaddress higher than block2 of SRAM, configured as 0x00</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_1_CATEGORY_3</name>
              <description>category3 of core_x_iram0_dram_dma_line, if the splitaddress in block3 of SRAM, configured as 0x10, else if the splitaddress below block3 of SRAM, configured as 0x11, else if splitaddress higher than block3 of SRAM, configured as 0x00</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_1_CATEGORY_4</name>
              <description>category4 of core_x_iram0_dram_dma_line, if the splitaddress in block4 of SRAM, configured as 0x10, else if the splitaddress below block4 of SRAM, configured as 0x11, else if splitaddress higher than block4 of SRAM, configured as 0x00</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_1_CATEGORY_5</name>
              <description>category5 of core_x_iram0_dram_dma_line, if the splitaddress in block5 of SRAM, configured as 0x10, else if the splitaddress below block5 of SRAM, configured as 0x11, else if splitaddress higher than block5 of SRAM, configured as 0x00</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_1_CATEGORY_6</name>
              <description>category6 of core_x_iram0_dram_dma_line, if the splitaddress in block6 of SRAM, configured as 0x10, else if the splitaddress below block6 of SRAM, configured as 0x11, else if splitaddress higher than block6 of SRAM, configured as 0x00</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_1_SPLITADDR</name>
              <description>splitaddr of core_x_iram0_dram_dma_line, configured as [15:8]bit of actual address</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_4</name>
          <description>sram split line configuration register 1</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_0_CATEGORY_0</name>
              <description>category0 of core_x_iram0_dram_dma_line, if the splitaddress in block0 of SRAM, configured as 0x10, else if the splitaddress below block0 of SRAM, configured as 0x11, else if splitaddress higher than block0 of SRAM, configured as 0x00</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_0_CATEGORY_1</name>
              <description>category1 of core_x_iram0_dram_dma_line, if the splitaddress in block1 of SRAM, configured as 0x10, else if the splitaddress below block1 of SRAM, configured as 0x11, else if splitaddress higher than block1 of SRAM, configured as 0x00</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_0_CATEGORY_2</name>
              <description>category2 of core_x_iram0_dram_dma_line, if the splitaddress in block2 of SRAM, configured as 0x10, else if the splitaddress below block2 of SRAM, configured as 0x11, else if splitaddress higher than block2 of SRAM, configured as 0x00</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_0_CATEGORY_3</name>
              <description>category3 of core_x_iram0_dram_dma_line, if the splitaddress in block3 of SRAM, configured as 0x10, else if the splitaddress below block3 of SRAM, configured as 0x11, else if splitaddress higher than block3 of SRAM, configured as 0x00</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_0_CATEGORY_4</name>
              <description>category4 of core_x_iram0_dram_dma_line, if the splitaddress in block4 of SRAM, configured as 0x10, else if the splitaddress below block4 of SRAM, configured as 0x11, else if splitaddress higher than block4 of SRAM, configured as 0x00</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_0_CATEGORY_5</name>
              <description>category5 of core_x_iram0_dram_dma_line, if the splitaddress in block5 of SRAM, configured as 0x10, else if the splitaddress below block5 of SRAM, configured as 0x11, else if splitaddress higher than block5 of SRAM, configured as 0x00</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_0_CATEGORY_6</name>
              <description>category6 of core_x_iram0_dram_dma_line, if the splitaddress in block6 of SRAM, configured as 0x10, else if the splitaddress below block6 of SRAM, configured as 0x11, else if splitaddress higher than block6 of SRAM, configured as 0x00</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_0_SPLITADDR</name>
              <description>splitaddr of core_x_iram0_dram_dma_line, configured as [15:8]bit of actual address</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_5</name>
          <description>sram split line configuration register 1</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_1_CATEGORY_0</name>
              <description>category0 of core_x_iram0_dram_dma_line, if the splitaddress in block0 of SRAM, configured as 0x10, else if the splitaddress below block0 of SRAM, configured as 0x11, else if splitaddress higher than block0 of SRAM, configured as 0x00</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_1_CATEGORY_1</name>
              <description>category1 of core_x_iram0_dram_dma_line, if the splitaddress in block1 of SRAM, configured as 0x10, else if the splitaddress below block1 of SRAM, configured as 0x11, else if splitaddress higher than block1 of SRAM, configured as 0x00</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_1_CATEGORY_2</name>
              <description>category2 of core_x_iram0_dram_dma_line, if the splitaddress in block2 of SRAM, configured as 0x10, else if the splitaddress below block2 of SRAM, configured as 0x11, else if splitaddress higher than block2 of SRAM, configured as 0x00</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_1_CATEGORY_3</name>
              <description>category3 of core_x_iram0_dram_dma_line, if the splitaddress in block3 of SRAM, configured as 0x10, else if the splitaddress below block3 of SRAM, configured as 0x11, else if splitaddress higher than block3 of SRAM, configured as 0x00</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_1_CATEGORY_4</name>
              <description>category4 of core_x_iram0_dram_dma_line, if the splitaddress in block4 of SRAM, configured as 0x10, else if the splitaddress below block4 of SRAM, configured as 0x11, else if splitaddress higher than block4 of SRAM, configured as 0x00</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_1_CATEGORY_5</name>
              <description>category5 of core_x_iram0_dram_dma_line, if the splitaddress in block5 of SRAM, configured as 0x10, else if the splitaddress below block5 of SRAM, configured as 0x11, else if splitaddress higher than block5 of SRAM, configured as 0x00</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_1_CATEGORY_6</name>
              <description>category6 of core_x_iram0_dram_dma_line, if the splitaddress in block6 of SRAM, configured as 0x10, else if the splitaddress below block6 of SRAM, configured as 0x11, else if splitaddress higher than block6 of SRAM, configured as 0x00</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_1_SPLITADDR</name>
              <description>splitaddr of core_x_iram0_dram_dma_line, configured as [15:8]bit of actual address</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_PMS_CONSTRAIN_0</name>
          <description>corex iram0 permission configuration register 0</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock corex iram0 permission configuration register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_PMS_CONSTRAIN_1</name>
          <description>corex iram0 permission configuration register 0</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <resetValue>0x001FFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_0</name>
              <description>core0/core1's permission of instruction region0 of SRAM in world1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_1</name>
              <description>core0/core1's permission of instruction region1 of SRAM in world1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_2</name>
              <description>core0/core1's permission of instruction region2 of SRAM in world1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_3</name>
              <description>core0/core1's permission of instruction region3 of SRAM in world1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_CACHEDATAARRAY_PMS_0</name>
              <description>core0/core1's permission of icache data sram block0 in world1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_CACHEDATAARRAY_PMS_1</name>
              <description>core0/core1's permission of icache data sram block1 in world1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_ROM_WORLD_1_PMS</name>
              <description>core0/core1's permission of rom in world1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_PMS_CONSTRAIN_2</name>
          <description>corex iram0 permission configuration register 1</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <resetValue>0x001FFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_0</name>
              <description>core0/core1's permission of instruction region0 of SRAM in world1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_1</name>
              <description>core0/core1's permission of instruction region1 of SRAM in world1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_2</name>
              <description>core0/core1's permission of instruction region2 of SRAM in world1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_3</name>
              <description>core0/core1's permission of instruction region3 of SRAM in world1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_CACHEDATAARRAY_PMS_0</name>
              <description>core0/core1's permission of icache data sram block0 in world1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_CACHEDATAARRAY_PMS_1</name>
              <description>core0/core1's permission of icache data sram block1 in world1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_ROM_WORLD_0_PMS</name>
              <description>core0/core1's permission of rom in world1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_IRAM0_PMS_MONITOR_0</name>
          <description>core0 iram0 permission monitor configuration register 0</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_LOCK</name>
              <description>Set 1 to lock core0 iram0 permission monitor register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_IRAM0_PMS_MONITOR_1</name>
          <description>core0 iram0 permission monitor configuration register 1</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_CLR</name>
              <description>Set 1 to clear core0 iram0 permission violated interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_EN</name>
              <description>Set 1 to enable core0 iram0 permission monitor, when core0_iram violated permission, will trigger interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_IRAM0_PMS_MONITOR_2</name>
          <description>core0 iram0 permission monitor configuration register 2</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR</name>
              <description>recorded core0 iram0 pms monitor interrupt status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_STATUS_WR</name>
              <description>recorded core0 iram0 wr status, only if loadstore is 1 have meaning, 1(store), 0(load).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_STATUS_LOADSTORE</name>
              <description>recorded core0 iram0 loadstore status, indicated the type of operation, 0(fetch), 1(load/store).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_STATUS_WORLD</name>
              <description>recorded core0 iram0 world status, 0x01 means world0, 0x10 means world1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_STATUS_ADDR</name>
              <description>recorded core0 iram0 address [25:2] status when core0 iram0 violated permission, the real address is 0x40000000+addr*4</description>
              <bitOffset>5</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_IRAM0_PMS_MONITOR_0</name>
          <description>core1 iram0 permission monitor configuration register 0</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_IRAM0_PMS_MONITOR_LOCK</name>
              <description>Set 1 to lock core1 iram0 permission monitor register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_IRAM0_PMS_MONITOR_1</name>
          <description>core1 iram0 permission monitor configuration register 1</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>CORE_1_IRAM0_PMS_MONITOR_VIOLATE_CLR</name>
              <description>Set 1 to clear core1 iram0 permission violated interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_PMS_MONITOR_VIOLATE_EN</name>
              <description>Set 1 to enable core1 iram0 permission monitor, when core1_iram violated permission, will trigger interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
