esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_7</name>
          <description>Core0 access peripherals permission configuration register 7.</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <resetValue>0x3CC3FFFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_SPI_2</name>
              <description>Core0 access spi_2 permission in world1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_SPI_3</name>
              <description>Core0 access spi_3 permission in world1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_APB_CTRL</name>
              <description>Core0 access apb_ctrl permission in world1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_I2C_EXT1</name>
              <description>Core0 access i2c_ext1 permission in world1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_SDIO_HOST</name>
              <description>Core0 access sdio_host permission in world1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_CAN</name>
              <description>Core0 access can permission in world1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_PWM1</name>
              <description>Core0 access pwm1 permission in world1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_I2S1</name>
              <description>Core0 access i2s1 permission in world1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_UART2</name>
              <description>Core0 access uart2 permission in world1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_RWBT</name>
              <description>Core0 access rwbt permission in world1.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_WIFIMAC</name>
              <description>Core0 access wifimac permission in world1.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_PWR</name>
              <description>Core0 access pwr permission in world1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_8</name>
          <description>Core0 access peripherals permission configuration register 8.</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_USB_DEVICE</name>
              <description>Core0 access usb_device permission in world1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_USB_WRAP</name>
              <description>Core0 access usb_wrap permission in world1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_CRYPTO_PERI</name>
              <description>Core0 access crypto_peri permission in world1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_CRYPTO_DMA</name>
              <description>Core0 access crypto_dma permission in world1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_APB_ADC</name>
              <description>Core0 access apb_adc permission in world1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_LCD_CAM</name>
              <description>Core0 access lcd_cam permission in world1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_BT_PWR</name>
              <description>Core0 access bt_pwr permission in world1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_USB</name>
              <description>Core0 access usb permission in world1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_SYSTEM</name>
              <description>Core0 access system permission in world1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_SENSITIVE</name>
              <description>Core0 access sensitive permission in world1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_INTERRUPT</name>
              <description>Core0 access interrupt permission in world1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_DMA_COPY</name>
              <description>Core0 access dma_copy permission in world1.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_CACHE_CONFIG</name>
              <description>Core0 access cache_config permission in world1.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_AD</name>
              <description>Core0 access ad permission in world1.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_DIO</name>
              <description>Core0 access dio permission in world1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_WORLD_CONTROLLER</name>
              <description>Core0 access world_controller permission in world1.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_9</name>
          <description>Core0 access peripherals permission configuration register 9.</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <resetValue>0x003FFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCFAST_SPLTADDR_WORLD_0</name>
              <description>RTCFast memory split address in world 0 for core0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCFAST_SPLTADDR_WORLD_1</name>
              <description>RTCFast memory split address in world 1 for core0.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_10</name>
          <description>Core0 access peripherals permission configuration register 10.</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCFAST_WORLD_0_L</name>
              <description>RTCFast memory low region permission in world 0 for core0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCFAST_WORLD_0_H</name>
              <description>RTCFast memory high region permission in world 0 for core0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCFAST_WORLD_1_L</name>
              <description>RTCFast memory low region permission in world 1 for core0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCFAST_WORLD_1_H</name>
              <description>RTCFast memory high region permission in world 1 for core0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_11</name>
          <description>Core0 access peripherals permission configuration register 11.</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <resetValue>0x003FFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCSLOW_0_SPLTADDR_WORLD_0</name>
              <description>RTCSlow_0 memory split address in world 0 for core0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCSLOW_0_SPLTADDR_WORLD_1</name>
              <description>RTCSlow_0 memory split address in world 1 for core0.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_12</name>
          <description>Core0 access peripherals permission configuration register 12.</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCSLOW_0_WORLD_0_L</name>
              <description>RTCSlow_0 memory low region permission in world 0 for core0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCSLOW_0_WORLD_0_H</name>
              <description>RTCSlow_0 memory high region permission in world 0 for core0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCSLOW_0_WORLD_1_L</name>
              <description>RTCSlow_0 memory low region permission in world 1 for core0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCSLOW_0_WORLD_1_H</name>
              <description>RTCSlow_0 memory high region permission in world 1 for core0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_13</name>
          <description>Core0 access peripherals permission configuration register 13.</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <resetValue>0x003FFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCSLOW_1_SPLTADDR_WORLD_0</name>
              <description>RTCSlow_1 memory split address in world 0 for core0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCSLOW_1_SPLTADDR_WORLD_1</name>
              <description>RTCSlow_1 memory split address in world 1 for core0.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_14</name>
          <description>Core0 access peripherals permission configuration register 14.</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCSLOW_1_WORLD_0_L</name>
              <description>RTCSlow_1 memory low region permission in world 0 for core0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCSLOW_1_WORLD_0_H</name>
              <description>RTCSlow_1 memory high region permission in world 0 for core0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCSLOW_1_WORLD_1_L</name>
              <description>RTCSlow_1 memory low region permission in world 1 for core0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCSLOW_1_WORLD_1_H</name>
              <description>RTCSlow_1 memory high region permission in world 1 for core0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_REGION_PMS_CONSTRAIN_0</name>
          <description>Core0 region permission register 0.</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_REGION_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock core0 region permission registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_REGION_PMS_CONSTRAIN_1</name>
          <description>Core0 region permission register 1.</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <resetValue>0x003FFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_REGION_PMS_CONSTRAIN_WORLD_0_AREA_0</name>
              <description>Region 0 permission in world 0 for core0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_REGION_PMS_CONSTRAIN_WORLD_0_AREA_1</name>
              <description>Region 1 permission in world 0 for core0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_REGION_PMS_CONSTRAIN_WORLD_0_AREA_2</name>
              <description>Region 2 permission in world 0 for core0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_REGION_PMS_CONSTRAIN_WORLD_0_AREA_3</name>
              <description>Region 3 permission in world 0 for core0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_REGION_PMS_CONSTRAIN_WORLD_0_AREA_4</name>
              <description>Region 4 permission in world 0 for core0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_REGION_PMS_CONSTRAIN_WORLD_0_AREA_5</name>
              <description>Region 5 permission in world 0 for core0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_REGION_PMS_CONSTRAIN_WORLD_0_AREA_6</name>
              <description>Region 6 permission in world 0 for core0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_REGION_PMS_CONSTRAIN_WORLD_0_AREA_7</name>
              <description>Region 7 permission in world 0 for core0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_REGION_PMS_CONSTRAIN_WORLD_0_AREA_8</name>
              <description>Region 8 permission in world 0 for core0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_REGION_PMS_CONSTRAIN_WORLD_0_AREA_9</name>
              <description>Region 9 permission in world 0 for core0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_REGION_PMS_CONSTRAIN_WORLD_0_AREA_10</name>
              <description>Region 10 permission in world 0 for core0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
