esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
        <register>
          <name>CORE_1_REGION_PMS_CONSTRAIN_1</name>
          <description>core1 region permission register 1.</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <resetValue>0x003FFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_0_AREA_0</name>
              <description>Region 0 permission in world 0 for core1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_0_AREA_1</name>
              <description>Region 1 permission in world 0 for core1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_0_AREA_2</name>
              <description>Region 2 permission in world 0 for core1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_0_AREA_3</name>
              <description>Region 3 permission in world 0 for core1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_0_AREA_4</name>
              <description>Region 4 permission in world 0 for core1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_0_AREA_5</name>
              <description>Region 5 permission in world 0 for core1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_0_AREA_6</name>
              <description>Region 6 permission in world 0 for core1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_0_AREA_7</name>
              <description>Region 7 permission in world 0 for core1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_0_AREA_8</name>
              <description>Region 8 permission in world 0 for core1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_0_AREA_9</name>
              <description>Region 9 permission in world 0 for core1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_0_AREA_10</name>
              <description>Region 10 permission in world 0 for core1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_REGION_PMS_CONSTRAIN_2</name>
          <description>core1 region permission register 2.</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <resetValue>0x003FFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_0</name>
              <description>Region 0 permission in world 1 for core1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_1</name>
              <description>Region 1 permission in world 1 for core1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_2</name>
              <description>Region 2 permission in world 1 for core1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_3</name>
              <description>Region 3 permission in world 1 for core1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_4</name>
              <description>Region 4 permission in world 1 for core1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_5</name>
              <description>Region 5 permission in world 1 for core1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_6</name>
              <description>Region 6 permission in world 1 for core1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_7</name>
              <description>Region 7 permission in world 1 for core1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_8</name>
              <description>Region 8 permission in world 1 for core1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_9</name>
              <description>Region 9 permission in world 1 for core1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_10</name>
              <description>Region 10 permission in world 1 for core1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_REGION_PMS_CONSTRAIN_3</name>
          <description>core1 region permission register 3.</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_ADDR_0</name>
              <description>Region 0 start address for core1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_REGION_PMS_CONSTRAIN_4</name>
          <description>core1 region permission register 4.</description>
          <addressOffset>0x21C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_ADDR_1</name>
              <description>Region 0 end address and Region 1 start address for core1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_REGION_PMS_CONSTRAIN_5</name>
          <description>core1 region permission register 5.</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_ADDR_2</name>
              <description>Region 1 end address and Region 2 start address for core1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_REGION_PMS_CONSTRAIN_6</name>
          <description>core1 region permission register 6.</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_ADDR_3</name>
              <description>Region 2 end address and Region 3 start address for core1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_REGION_PMS_CONSTRAIN_7</name>
          <description>core1 region permission register 7.</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_ADDR_4</name>
              <description>Region 3 end address and Region 4 start address for core1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_REGION_PMS_CONSTRAIN_8</name>
          <description>core1 region permission register 8.</description>
          <addressOffset>0x22C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_ADDR_5</name>
              <description>Region 4 end address and Region 5 start address for core1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_REGION_PMS_CONSTRAIN_9</name>
          <description>core1 region permission register 9.</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_ADDR_6</name>
              <description>Region 5 end address and Region 6 start address for core1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_REGION_PMS_CONSTRAIN_10</name>
          <description>core1 region permission register 10.</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_ADDR_7</name>
              <description>Region 6 end address and Region 7 start address for core1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_REGION_PMS_CONSTRAIN_11</name>
          <description>core1 region permission register 11.</description>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_ADDR_8</name>
              <description>Region 7 end address and Region 8 start address for core1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_REGION_PMS_CONSTRAIN_12</name>
          <description>core1 region permission register 12.</description>
          <addressOffset>0x23C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_ADDR_9</name>
              <description>Region 8 end address and Region 9 start address for core1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_REGION_PMS_CONSTRAIN_13</name>
          <description>core1 region permission register 13.</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_ADDR_10</name>
              <description>Region 9 end address and Region 10 start address for core1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_REGION_PMS_CONSTRAIN_14</name>
          <description>core1 region permission register 14.</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_REGION_PMS_CONSTRAIN_ADDR_11</name>
              <description>Region 10 end address for core1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_PIF_PMS_MONITOR_0</name>
          <description>core1 permission report register 0.</description>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_LOCK</name>
              <description>Set 1 to lock core1 permission report registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_PIF_PMS_MONITOR_1</name>
          <description>core1 permission report register 1.</description>
          <addressOffset>0x24C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_VIOLATE_CLR</name>
              <description>Set 1 to clear interrupt that core1 initiate illegal PIF bus access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_VIOLATE_EN</name>
              <description>Set 1 to enable interrupt that core1 initiate illegal PIF bus access.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_PIF_PMS_MONITOR_2</name>
          <description>core1 permission report register 2.</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR</name>
              <description>Record core1 illegal access interrupt state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HPORT_0</name>
              <description>Record hport information when core1 initiate illegal access.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE</name>
              <description>Record access type when core1 initate illegal access.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE</name>
              <description>Record access direction when core1 initiate illegal access.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD</name>
              <description>Record world information when core1 initiate illegal access.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_PIF_PMS_MONITOR_3</name>
          <description>core1 permission report register 3.</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HADDR</name>
              <description>Record address information when core1 initiate illegal access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_PIF_PMS_MONITOR_4</name>
          <description>core1 permission report register 4.</description>
          <addressOffset>0x258</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_CLR</name>
              <description>Set 1 to clear interrupt that core1 initiate unsupported access type.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_EN</name>
              <description>Set 1 to enable interrupt that core1 initiate unsupported access type.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_PIF_PMS_MONITOR_5</name>
          <description>core1 permission report register 5.</description>
          <addressOffset>0x25C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_INTR</name>
              <description>Record core1 unsupported access type interrupt state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HSIZE</name>
              <description>Record access type when core1 initiate unsupported access type.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HWORLD</name>
              <description>Record world information when core1 initiate unsupported access type.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_PIF_PMS_MONITOR_6</name>
          <description>core1 permission report register 6.</description>
          <addressOffset>0x260</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HADDR</name>
              <description>Record address information when core1 initiate unsupported access type.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_VECBASE_OVERRIDE_LOCK</name>
          <description>core1 vecbase override configuration register 0</description>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_VECBASE_OVERRIDE_LOCK</name>
              <description>Set 1 to lock core1 vecbase configuration register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_VECBASE_OVERRIDE_0</name>
          <description>core1 vecbase override configuration register 0</description>
          <addressOffset>0x268</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CORE_1_VECBASE_WORLD_MASK</name>
              <description>Set 1 to mask world, then only world0_value will work.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_VECBASE_OVERRIDE_1</name>
          <description>core1 vecbase override configuration register 1</description>
          <addressOffset>0x26C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_VECBASE_OVERRIDE_WORLD0_VALUE</name>
              <description>world0 vecbase_override register, when core1 in world0 use this register to override vecbase register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_VECBASE_OVERRIDE_SEL</name>
              <description>Set 0x3 to sel vecbase_override to override vecbase register.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
