esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
        <register>
          <name>CORE_1_VECBASE_OVERRIDE_2</name>
          <description>core1 vecbase override configuration register 1</description>
          <addressOffset>0x270</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_VECBASE_OVERRIDE_WORLD1_VALUE</name>
              <description>world1 vecbase_override register, when core1 in world1 use this register to override vecbase register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_0</name>
          <description>core1 toomanyexception override configuration register 0.</description>
          <addressOffset>0x274</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_LOCK</name>
              <description>Set 1 to lock core1 toomanyexception override configuration register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_1</name>
          <description>core1 toomanyexception override configuration register 1.</description>
          <addressOffset>0x278</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE</name>
              <description>Set 1 to mask toomanyexception.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_CONSTRAIN_0</name>
          <description>BackUp access peripherals permission configuration register 0.</description>
          <addressOffset>0x27C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock BackUp permission configuration registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_CONSTRAIN_1</name>
          <description>BackUp access peripherals permission configuration register 1.</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <resetValue>0xFF33CFFF</resetValue>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_UART</name>
              <description>BackUp access uart permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_G0SPI_1</name>
              <description>BackUp access g0spi_1 permission.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_G0SPI_0</name>
              <description>BackUp access g0spi_0 permission.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_GPIO</name>
              <description>BackUp access gpio permission.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_FE2</name>
              <description>BackUp access fe2 permission.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_FE</name>
              <description>BackUp access fe permission.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_RTC</name>
              <description>BackUp access rtc permission.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_IO_MUX</name>
              <description>BackUp access io_mux permission.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_HINF</name>
              <description>BackUp access hinf permission.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_MISC</name>
              <description>BackUp access misc permission.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_I2C</name>
              <description>BackUp access i2c permission.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_I2S0</name>
              <description>BackUp access i2s0 permission.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_UART1</name>
              <description>BackUp access uart1 permission.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_CONSTRAIN_2</name>
          <description>BackUp access peripherals permission configuration register 2.</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFCFFFF3</resetValue>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_BT</name>
              <description>BackUp access bt permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT0</name>
              <description>BackUp access i2c_ext0 permission.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_UHCI0</name>
              <description>BackUp access uhci0 permission.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_SLCHOST</name>
              <description>BackUp access slchost permission.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_RMT</name>
              <description>BackUp access rmt permission.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_PCNT</name>
              <description>BackUp access pcnt permission.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_SLC</name>
              <description>BackUp access slc permission.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_LEDC</name>
              <description>BackUp access ledc permission.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_BACKUP</name>
              <description>BackUp access backup permission.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_BB</name>
              <description>BackUp access bb permission.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_PWM0</name>
              <description>BackUp access pwm0 permission.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP</name>
              <description>BackUp access timergroup permission.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP1</name>
              <description>BackUp access timergroup1 permission.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_SYSTIMER</name>
              <description>BackUp access systimer permission.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_CONSTRAIN_3</name>
          <description>BackUp access peripherals permission configuration register 3.</description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
          <resetValue>0x3CC3FFFF</resetValue>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_SPI_2</name>
              <description>BackUp access spi_2 permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_SPI_3</name>
              <description>BackUp access spi_3 permission.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_APB_CTRL</name>
              <description>BackUp access apb_ctrl permission.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT1</name>
              <description>BackUp access i2c_ext1 permission.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_SDIO_HOST</name>
              <description>BackUp access sdio_host permission.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_CAN</name>
              <description>BackUp access can permission.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_PWM1</name>
              <description>BackUp access pwm1 permission.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_I2S1</name>
              <description>BackUp access i2s1 permission.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_UART2</name>
              <description>BackUp access uart2 permission.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_RWBT</name>
              <description>BackUp access rwbt permission.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_WIFIMAC</name>
              <description>BackUp access wifimac permission.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_PWR</name>
              <description>BackUp access pwr permission.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_CONSTRAIN_4</name>
          <description>BackUp access peripherals permission configuration register 4.</description>
          <addressOffset>0x28C</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_USB_DEVICE</name>
              <description>BackUp access usb_device permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_USB_WRAP</name>
              <description>BackUp access usb_wrap permission.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_PERI</name>
              <description>BackUp access crypto_peri permission.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_DMA</name>
              <description>BackUp access crypto_dma permission.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_APB_ADC</name>
              <description>BackUp access apb_adc permission.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_LCD_CAM</name>
              <description>BackUp access lcd_cam permission.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_BT_PWR</name>
              <description>BackUp access bt_pwr permission.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_USB</name>
              <description>BackUp access usb permission.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_SYSTEM</name>
              <description>BackUp access system permission.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_SENSITIVE</name>
              <description>BackUp access sensitive permission.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_INTERRUPT</name>
              <description>BackUp access interrupt permission.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_DMA_COPY</name>
              <description>BackUp access dma_copy permission.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_CACHE_CONFIG</name>
              <description>BackUp access cache_config permission.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_AD</name>
              <description>BackUp access ad permission.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_DIO</name>
              <description>BackUp access dio permission.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_WORLD_CONTROLLER</name>
              <description>BackUp access world_controller permission.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_CONSTRAIN_5</name>
          <description>BackUp access peripherals permission configuration register 5.</description>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
          <resetValue>0x000007FF</resetValue>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_SPLTADDR</name>
              <description>BackUp access rtcfast_spltaddr permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_CONSTRAIN_6</name>
          <description>BackUp access peripherals permission configuration register 6.</description>
          <addressOffset>0x294</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000003F</resetValue>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_L</name>
              <description>BackUp access rtcfast_l permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_H</name>
              <description>BackUp access rtcfast_h permission.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_MONITOR_0</name>
          <description>BackUp permission report register 0.</description>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_LOCK</name>
              <description>Set 1 to lock BackUp permission report registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_MONITOR_1</name>
          <description>BackUp permission report register 1.</description>
          <addressOffset>0x29C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_VIOLATE_CLR</name>
              <description>Set 1 to clear interrupt that BackUp initiate illegal access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_VIOLATE_EN</name>
              <description>Set 1 to enable interrupt that BackUp initiate illegal access.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
