esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
        <register>
          <name>BACKUP_BUS_PMS_MONITOR_2</name>
          <description>BackUp permission report register 2.</description>
          <addressOffset>0x2A0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_VIOLATE_INTR</name>
              <description>Record BackUp illegal access interrupt state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_VIOLATE_STATUS_HTRANS</name>
              <description>Record htrans when BackUp initate illegal access.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_VIOLATE_STATUS_HSIZE</name>
              <description>Record access type when BackUp initate illegal access.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_VIOLATE_STATUS_HWRITE</name>
              <description>Record access direction when BackUp initiate illegal access.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_MONITOR_3</name>
          <description>BackUp permission report register 3.</description>
          <addressOffset>0x2A4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_VIOLATE_HADDR</name>
              <description>Record address information when BackUp initiate illegal access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_BOUNDARY_LOCK</name>
          <description>EDMA boundary lock register.</description>
          <addressOffset>0x2A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDMA_BOUNDARY_LOCK</name>
              <description>Set 1 to lock EDMA boundary registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_BOUNDARY_0</name>
          <description>EDMA boundary 0 configuration</description>
          <addressOffset>0x2AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDMA_BOUNDARY_0</name>
              <description>This field is used to configure the boundary 0 of external RAM. The unit is 4K. For example, set this field to 0x80, then the address boundary 0 would be 0x3C080000 (0x3C000000 + 0x80 * 4K).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_BOUNDARY_1</name>
          <description>EDMA boundary 1 configuration</description>
          <addressOffset>0x2B0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00002000</resetValue>
          <fields>
            <field>
              <name>EDMA_BOUNDARY_1</name>
              <description>This field is used to configure the boundary 1 of external RAM. The unit is 4K. For example, set this field to 0x80, then the address boundary 0 would be 0x3C080000 (0x3C000000 + 0x80 * 4K).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_BOUNDARY_2</name>
          <description>EDMA boundary 2 configuration</description>
          <addressOffset>0x2B4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00002000</resetValue>
          <fields>
            <field>
              <name>EDMA_BOUNDARY_2</name>
              <description>This field is used to configure the boundary 2 of external RAM. The unit is 4K. For example, set this field to 0x80, then the address boundary 0 would be 0x3C080000 (0x3C000000 + 0x80 * 4K).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_SPI2_LOCK</name>
          <description>EDMA-SPI2 permission lock register.</description>
          <addressOffset>0x2B8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDMA_PMS_SPI2_LOCK</name>
              <description>Set 1 to lock EDMA-SPI2 permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_SPI2</name>
          <description>EDMA-SPI2 permission control register.</description>
          <addressOffset>0x2BC</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>ATTR1</name>
              <description>This field is used to configure the permission of SPI2 accessing address, which is larger than boundary 0 and less than boundary 1, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR2</name>
              <description>This field is used to configure the permission of SPI2 accessing address, which is larger than boundary 1 and less than boundary 2, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_SPI3_LOCK</name>
          <description>EDMA-SPI3 permission lock register.</description>
          <addressOffset>0x2C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDMA_PMS_SPI3_LOCK</name>
              <description>Set 1 to lock EDMA-SPI3 permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_SPI3</name>
          <description>EDMA-SPI3 permission control register.</description>
          <addressOffset>0x2C4</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>ATTR1</name>
              <description>This field is used to configure the permission of SPI3 accessing address, which is larger than boundary 0 and less than boundary 1, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR2</name>
              <description>This field is used to configure the permission of SPI3 accessing address, which is larger than boundary 1 and less than boundary 2, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_UHCI0_LOCK</name>
          <description>EDMA-UHCI0 permission lock register.</description>
          <addressOffset>0x2C8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDMA_PMS_UHCI0_LOCK</name>
              <description>Set 1 to lock EDMA-UHCI0 permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_UHCI0</name>
          <description>EDMA-UHCI0 permission control register.</description>
          <addressOffset>0x2CC</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>ATTR1</name>
              <description>This field is used to configure the permission of UHCI0 accessing address, which is larger than boundary 0 and less than boundary 1, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR2</name>
              <description>This field is used to configure the permission of UHCI0 accessing address, which is larger than boundary 1 and less than boundary 2, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_I2S0_LOCK</name>
          <description>EDMA-I2S0 permission lock register.</description>
          <addressOffset>0x2D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDMA_PMS_I2S0_LOCK</name>
              <description>Set 1 to lock EDMA-I2S0 permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_I2S0</name>
          <description>EDMA-I2S0 permission control register.</description>
          <addressOffset>0x2D4</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>ATTR1</name>
              <description>This field is used to configure the permission of I2S0 accessing address, which is larger than boundary 0 and less than boundary 1, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR2</name>
              <description>This field is used to configure the permission of I2S0 accessing address, which is larger than boundary 1 and less than boundary 2, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_I2S1_LOCK</name>
          <description>EDMA-I2S1 permission lock register.</description>
          <addressOffset>0x2D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDMA_PMS_I2S1_LOCK</name>
              <description>Set 1 to lock EDMA-I2S1 permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_I2S1</name>
          <description>EDMA-I2S1 permission control register.</description>
          <addressOffset>0x2DC</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>ATTR1</name>
              <description>This field is used to configure the permission of I2S1 accessing address, which is larger than boundary 0 and less than boundary 1, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR2</name>
              <description>This field is used to configure the permission of I2S1 accessing address, which is larger than boundary 1 and less than boundary 2, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_LCD_CAM_LOCK</name>
          <description>EDMA-LCD/CAM permission lock register.</description>
          <addressOffset>0x2E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDMA_PMS_LCD_CAM_LOCK</name>
              <description>Set 1 to lock EDMA-LCD/CAM permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_LCD_CAM</name>
          <description>EDMA-LCD/CAM permission control register.</description>
          <addressOffset>0x2E4</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>ATTR1</name>
              <description>This field is used to configure the permission of LCD/CAM accessing address, which is larger than boundary 0 and less than boundary 1, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR2</name>
              <description>This field is used to configure the permission of LCD/CAM accessing address, which is larger than boundary 1 and less than boundary 2, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_AES_LOCK</name>
          <description>EDMA-AES permission lock register.</description>
          <addressOffset>0x2E8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDMA_PMS_AES_LOCK</name>
              <description>Set 1 to lock EDMA-AES permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_AES</name>
          <description>EDMA-AES permission control register.</description>
          <addressOffset>0x2EC</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>ATTR1</name>
              <description>This field is used to configure the permission of AES accessing address, which is larger than boundary 0 and less than boundary 1, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR2</name>
              <description>This field is used to configure the permission of AES accessing address, which is larger than boundary 1 and less than boundary 2, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_SHA_LOCK</name>
          <description>EDMA-SHA permission lock register.</description>
          <addressOffset>0x2F0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDMA_PMS_SHA_LOCK</name>
              <description>Set 1 to lock EDMA-SHA permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_SHA</name>
          <description>EDMA-SHA permission control register.</description>
          <addressOffset>0x2F4</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>ATTR1</name>
              <description>This field is used to configure the permission of SHA accessing address, which is larger than boundary 0 and less than boundary 1, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR2</name>
              <description>This field is used to configure the permission of SHA accessing address, which is larger than boundary 1 and less than boundary 2, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_ADC_DAC_LOCK</name>
          <description>EDMA-ADC/DAC permission lock register.</description>
          <addressOffset>0x2F8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDMA_PMS_ADC_DAC_LOCK</name>
              <description>Set 1 to lock EDMA-ADC/DAC permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_ADC_DAC</name>
          <description>EDMA-ADC/DAC permission control register.</description>
          <addressOffset>0x2FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>ATTR1</name>
              <description>This field is used to configure the permission of ADC/DAC accessing address, which is larger than boundary 0 and less than boundary 1, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR2</name>
              <description>This field is used to configure the permission of ADC/DAC accessing address, which is larger than boundary 1 and less than boundary 2, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_RMT_LOCK</name>
          <description>EDMA-RMT permission lock register.</description>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDMA_PMS_RMT_LOCK</name>
              <description>Set 1 to lock EDMA-RMT permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDMA_PMS_RMT</name>
          <description>EDMA-RMT permission control register.</description>
          <addressOffset>0x304</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>ATTR1</name>
              <description>This field is used to configure the permission of RMT accessing address, which is larger than boundary 0 and less than boundary 1, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR2</name>
              <description>This field is used to configure the permission of RMT accessing address, which is larger than boundary 1 and less than boundary 2, through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set this bit to enable write permission.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Sensitive module clock gate configuration register.</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>REG_CLK_EN</name>
              <description>Set 1 to enable clock gate function.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
