esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
        <register>
          <name>Core_0_STATUSTABLE13</name>
          <description>Status register of world switch of entry 13</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_FROM_WORLD_13</name>
              <description>This bit is used to confirm world before enter entry 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_FROM_ENTRY_13</name>
              <description>This filed is used to confirm in which entry before enter entry 13</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_CURRENT_13</name>
              <description>This bit is used to confirm whether the current state is in entry 13</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_STATUSTABLE_CURRENT</name>
          <description>Status register of statustable current</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_STATUSTABLE_CURRENT</name>
              <description>This field is used to quickly read and rewrite the current field of all STATUSTABLE registers,for example,bit 1 represents the current field of STATUSTABLE1,bit2 represents the current field of STATUSTABLE2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_MESSAGE_ADDR</name>
          <description>Clear writer_buffer write address configuration register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_MESSAGE_ADDR</name>
              <description>This field is used to set address that need to write when enter WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_MESSAGE_MAX</name>
          <description>Clear writer_buffer write number configuration register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_MESSAGE_MAX</name>
              <description>This filed is used to set the max value of clear write_buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_MESSAGE_PHASE</name>
          <description>Clear writer_buffer status register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_MESSAGE_MATCH</name>
              <description>This bit indicates whether the check is successful</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_MESSAGE_EXPECT</name>
              <description>This field indicates the data to be written next time</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_MESSAGE_DATAPHASE</name>
              <description>If this bit is 1, it means that is checking clear write_buffer operation,and is checking data</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_MESSAGE_ADDRESSPHASE</name>
              <description>If this bit is 1, it means that is checking clear write_buffer operation,and is checking address.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_World_TRIGGER_ADDR</name>
          <description>Core_0 trigger address configuration Register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_WORLD_TRIGGER_ADDR</name>
              <description>This field is used to configure the entry address from WORLD0 to WORLD1,when the CPU executes to this address,switch to WORLD1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_World_PREPARE</name>
          <description>Core_0 prepare world configuration Register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_WORLD_PREPARE</name>
              <description>This field to used to set world to enter,  2'b01 means WORLD0, 2'b10 means WORLD1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_World_UPDATE</name>
          <description>Core_0 configuration update register</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_UPDATE</name>
              <description>This field is used to update configuration completed, can write any value,the hardware only checks the write operation of this register and does not case about its value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_World_Cancel</name>
          <description>Core_0 configuration cancel register</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_WORLD_CANCEL</name>
              <description>This field is used to cancel switch world configuration,if the trigger address and update configuration complete,use this register to cancel world switch, jujst need write any value,the hardware only checks the write operation of this register and does not case about its value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_World_IRam0</name>
          <description>Core_0 Iram0 world register</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_WORLD_IRAM0</name>
              <description>this field is used to read current world of Iram0 bus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_World_DRam0_PIF</name>
          <description>Core_0 dram0 and PIF world register</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_WORLD_DRAM0_PIF</name>
              <description>this field is used to read current world of Dram0 bus and PIF bus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_World_Phase</name>
          <description>Core_0 world status register</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_WORLD_PHASE</name>
              <description>This bit indicates whether is preparing to switch to WORLD1, 1 means value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_NMI_MASK_ENABLE</name>
          <description>Core_0 NMI mask enable register</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_NMI_MASK_ENABLE</name>
              <description>this field is used to set NMI mask,it can write any value,when write this register,the hardware start masking NMI interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_NMI_MASK_TRIGGER_ADDR</name>
          <description>Core_0 NMI mask trigger address register</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_NMI_MASK_TRIGGER_ADDR</name>
              <description>this field to used to set trigger address, when CPU executes to this address,NMI mask automatically fails</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_NMI_MASK_DISABLE</name>
          <description>Core_0 NMI mask disable register</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_NMI_MASK_DISABLE</name>
              <description>this field is used to disable NMI mask,it will not take effect immediately,only when the CPU executes to the trigger address will it start to cancel NMI mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_NMI_MASK_CANCLE</name>
          <description>Core_0 NMI mask disable register</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_NMI_MASK_CANCEL</name>
              <description>this field is used to cancel NMI mask disable function.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_NMI_MASK</name>
          <description>Core_0 NMI mask register</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_NMI_MASK</name>
              <description>this bit is used to mask NMI interrupt,it can directly mask NMI interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_NMI_MASK_PHASE</name>
          <description>Core_0 NMI mask phase register</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_NMI_MASK_PHASE</name>
              <description>this bit is used to indicates whether the NMI interrupt is being masked, 1 means NMI interrupt is being masked</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_ENTRY_1_ADDR</name>
          <description>Core_1 Entry 1 address configuration Register</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_ENTRY_1_ADDR</name>
              <description>Core_1 Entry 1 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_ENTRY_2_ADDR</name>
          <description>Core_1 Entry 2 address configuration Register</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_ENTRY_2_ADDR</name>
              <description>Core_1 Entry 2 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_ENTRY_3_ADDR</name>
          <description>Core_1 Entry 3 address configuration Register</description>
          <addressOffset>0x408</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_ENTRY_3_ADDR</name>
              <description>Core_1 Entry 3 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_ENTRY_4_ADDR</name>
          <description>Core_1 Entry 4 address configuration Register</description>
          <addressOffset>0x40C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_ENTRY_4_ADDR</name>
              <description>Core_1 Entry 4 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_ENTRY_5_ADDR</name>
          <description>Core_1 Entry 5 address configuration Register</description>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_ENTRY_5_ADDR</name>
              <description>Core_1 Entry 5 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_ENTRY_6_ADDR</name>
          <description>Core_1 Entry 6 address configuration Register</description>
          <addressOffset>0x414</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_ENTRY_6_ADDR</name>
              <description>Core_1 Entry 6 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_ENTRY_7_ADDR</name>
          <description>Core_1 Entry 7 address configuration Register</description>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_ENTRY_7_ADDR</name>
              <description>Core_1 Entry 7 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_ENTRY_8_ADDR</name>
          <description>Core_1 Entry 8 address configuration Register</description>
          <addressOffset>0x41C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_ENTRY_8_ADDR</name>
              <description>Core_1 Entry 8 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_ENTRY_9_ADDR</name>
          <description>Core_1 Entry 9 address configuration Register</description>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_ENTRY_9_ADDR</name>
              <description>Core_1 Entry 9 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_ENTRY_10_ADDR</name>
          <description>Core_1 Entry 10 address configuration Register</description>
          <addressOffset>0x424</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_ENTRY_10_ADDR</name>
              <description>Core_1 Entry 10 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_ENTRY_11_ADDR</name>
          <description>Core_1 Entry 11 address configuration Register</description>
          <addressOffset>0x428</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_ENTRY_11_ADDR</name>
              <description>Core_1 Entry 11 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_ENTRY_12_ADDR</name>
          <description>Core_1 Entry 12 address configuration Register</description>
          <addressOffset>0x42C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_ENTRY_12_ADDR</name>
              <description>Core_1 Entry 12 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_ENTRY_13_ADDR</name>
          <description>Core_1 Entry 13 address configuration Register</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_ENTRY_13_ADDR</name>
              <description>Core_1 Entry 13 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_ENTRY_CHECK</name>
          <description>Core_1 Entry check configuration Register</description>
          <addressOffset>0x47C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>CORE_1_ENTRY_CHECK</name>
              <description>This filed is used to enable entry address check</description>
              <bitOffset>1</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_STATUSTABLE1</name>
          <description>Status register of world switch of entry 1</description>
          <addressOffset>0x480</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_FROM_WORLD_1</name>
              <description>This bit is used to confirm world before enter entry 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_FROM_ENTRY_1</name>
              <description>This filed is used to confirm in which entry before enter entry 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_CURRENT_1</name>
              <description>This bit is used to confirm whether the current state is in entry 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_STATUSTABLE2</name>
          <description>Status register of world switch of entry 2</description>
          <addressOffset>0x484</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_FROM_WORLD_2</name>
              <description>This bit is used to confirm world before enter entry 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_FROM_ENTRY_2</name>
              <description>This filed is used to confirm in which entry before enter entry 2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_CURRENT_2</name>
              <description>This bit is used to confirm whether the current state is in entry 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
