esp-rs/esp-pacs/esp32s3/svd/esp32s3.base.svd
        <register>
          <name>Core_1_STATUSTABLE3</name>
          <description>Status register of world switch of entry 3</description>
          <addressOffset>0x488</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_FROM_WORLD_3</name>
              <description>This bit is used to confirm world before enter entry 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_FROM_ENTRY_3</name>
              <description>This filed is used to confirm in which entry before enter entry 3</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_CURRENT_3</name>
              <description>This bit is used to confirm whether the current state is in entry 3</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_STATUSTABLE4</name>
          <description>Status register of world switch of entry 4</description>
          <addressOffset>0x48C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_FROM_WORLD_4</name>
              <description>This bit is used to confirm world before enter entry 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_FROM_ENTRY_4</name>
              <description>This filed is used to confirm in which entry before enter entry 4</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_CURRENT_4</name>
              <description>This bit is used to confirm whether the current state is in entry 4</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_STATUSTABLE5</name>
          <description>Status register of world switch of entry 5</description>
          <addressOffset>0x490</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_FROM_WORLD_5</name>
              <description>This bit is used to confirm world before enter entry 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_FROM_ENTRY_5</name>
              <description>This filed is used to confirm in which entry before enter entry 5</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_CURRENT_5</name>
              <description>This bit is used to confirm whether the current state is in entry 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_STATUSTABLE6</name>
          <description>Status register of world switch of entry 6</description>
          <addressOffset>0x494</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_FROM_WORLD_6</name>
              <description>This bit is used to confirm world before enter entry 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_FROM_ENTRY_6</name>
              <description>This filed is used to confirm in which entry before enter entry 6</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_CURRENT_6</name>
              <description>This bit is used to confirm whether the current state is in entry 6</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_STATUSTABLE7</name>
          <description>Status register of world switch of entry 7</description>
          <addressOffset>0x498</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_FROM_WORLD_7</name>
              <description>This bit is used to confirm world before enter entry 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_FROM_ENTRY_7</name>
              <description>This filed is used to confirm in which entry before enter entry 7</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_CURRENT_7</name>
              <description>This bit is used to confirm whether the current state is in entry 7</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_STATUSTABLE8</name>
          <description>Status register of world switch of entry 8</description>
          <addressOffset>0x49C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_FROM_WORLD_8</name>
              <description>This bit is used to confirm world before enter entry 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_FROM_ENTRY_8</name>
              <description>This filed is used to confirm in which entry before enter entry 8</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_CURRENT_8</name>
              <description>This bit is used to confirm whether the current state is in entry 8</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_STATUSTABLE9</name>
          <description>Status register of world switch of entry 9</description>
          <addressOffset>0x4A0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_FROM_WORLD_9</name>
              <description>This bit is used to confirm world before enter entry 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_FROM_ENTRY_9</name>
              <description>This filed is used to confirm in which entry before enter entry 9</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_CURRENT_9</name>
              <description>This bit is used to confirm whether the current state is in entry 9</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_STATUSTABLE10</name>
          <description>Status register of world switch of entry 10</description>
          <addressOffset>0x4A4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_FROM_WORLD_10</name>
              <description>This bit is used to confirm world before enter entry 10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_FROM_ENTRY_10</name>
              <description>This filed is used to confirm in which entry before enter entry 10</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_CURRENT_10</name>
              <description>This bit is used to confirm whether the current state is in entry 10</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_STATUSTABLE11</name>
          <description>Status register of world switch of entry 11</description>
          <addressOffset>0x4A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_FROM_WORLD_11</name>
              <description>This bit is used to confirm world before enter entry 11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_FROM_ENTRY_11</name>
              <description>This filed is used to confirm in which entry before enter entry 11</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_CURRENT_11</name>
              <description>This bit is used to confirm whether the current state is in entry 11</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_STATUSTABLE12</name>
          <description>Status register of world switch of entry 12</description>
          <addressOffset>0x4AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_FROM_WORLD_12</name>
              <description>This bit is used to confirm world before enter entry 12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_FROM_ENTRY_12</name>
              <description>This filed is used to confirm in which entry before enter entry 12</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_CURRENT_12</name>
              <description>This bit is used to confirm whether the current state is in entry 12</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_STATUSTABLE13</name>
          <description>Status register of world switch of entry 13</description>
          <addressOffset>0x4B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_FROM_WORLD_13</name>
              <description>This bit is used to confirm world before enter entry 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_FROM_ENTRY_13</name>
              <description>This filed is used to confirm in which entry before enter entry 13</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_CURRENT_13</name>
              <description>This bit is used to confirm whether the current state is in entry 13</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_STATUSTABLE_CURRENT</name>
          <description>Status register of statustable current</description>
          <addressOffset>0x4FC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_STATUSTABLE_CURRENT</name>
              <description>This field is used to quickly read and rewrite the current field of all STATUSTABLE registers,for example,bit 1 represents the current field of STATUSTABLE1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_MESSAGE_ADDR</name>
          <description>Clear writer_buffer write address configuration register</description>
          <addressOffset>0x500</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_MESSAGE_ADDR</name>
              <description>This field is used to set address that need to write when enter WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_MESSAGE_MAX</name>
          <description>Clear writer_buffer write number configuration register</description>
          <addressOffset>0x504</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_MESSAGE_MAX</name>
              <description>This filed is used to set the max value of clear write_buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_MESSAGE_PHASE</name>
          <description>Clear writer_buffer status register</description>
          <addressOffset>0x508</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_MESSAGE_MATCH</name>
              <description>This bit indicates whether the check is successful</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_MESSAGE_EXPECT</name>
              <description>This field indicates the data to be written next time</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_MESSAGE_DATAPHASE</name>
              <description>If this bit is 1, it means that is checking clear write_buffer operation, and is checking data</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_MESSAGE_ADDRESSPHASE</name>
              <description>If this bit is 1, it means that is checking clear write_buffer operation, and is checking address.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_World_TRIGGER_ADDR</name>
          <description>Core_1 trigger address configuration Register</description>
          <addressOffset>0x540</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_WORLD_TRIGGER_ADDR</name>
              <description>This field is used to configure the entry address from WORLD0 to WORLD1,when the CPU executes to this address,switch to WORLD1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_World_PREPARE</name>
          <description>Core_1 prepare world configuration Register</description>
          <addressOffset>0x544</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_WORLD_PREPARE</name>
              <description>This field to used to set world to enter,2'b01 means WORLD0, 2'b10 means WORLD1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_World_UPDATE</name>
          <description>Core_1 configuration update register</description>
          <addressOffset>0x548</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_UPDATE</name>
              <description>This field is used to update configuration completed, can write any value,the hardware only checks the write operation of this register and does not case about its value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_World_Cancel</name>
          <description>Core_1 configuration cancel register</description>
          <addressOffset>0x54C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_WORLD_CANCEL</name>
              <description>This field is used to cancel switch world configuration,if the trigger address and update configuration complete,can use this register to cancel world switch. can write any value, the hardware only checks the write operation of this register and does not case about its value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_World_IRam0</name>
          <description>Core_1 Iram0 world register</description>
          <addressOffset>0x550</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_WORLD_IRAM0</name>
              <description>this field is used to read current world of Iram0 bus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_World_DRam0_PIF</name>
          <description>Core_1 dram0 and PIF world register</description>
          <addressOffset>0x554</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_WORLD_DRAM0_PIF</name>
              <description>this field is used to read current world of Dram0 bus and PIF bus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_World_Phase</name>
          <description>Core_0 world status register</description>
          <addressOffset>0x558</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_WORLD_PHASE</name>
              <description>This bit indicates whether is preparing to switch to WORLD1,1 means value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_NMI_MASK_ENABLE</name>
          <description>Core_1 NMI mask enable register</description>
          <addressOffset>0x580</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_NMI_MASK_ENABLE</name>
              <description>this field is used to set NMI mask, it can write any value, when write this register,the hardware start masking NMI interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_NMI_MASK_TRIGGER_ADDR</name>
          <description>Core_1 NMI mask trigger addr register</description>
          <addressOffset>0x584</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_NMI_MASK_TRIGGER_ADDR</name>
              <description>this field to used to set trigger address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_NMI_MASK_DISABLE</name>
          <description>Core_1 NMI mask disable register</description>
          <addressOffset>0x588</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_NMI_MASK_DISABLE</name>
              <description>this field is used to disable NMI mask, it will not take effect immediately,only when the CPU executes to the trigger address will it start to cancel NMI mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_1_NMI_MASK_CANCLE</name>
          <description>Core_1 NMI mask disable register</description>
          <addressOffset>0x58C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_NMI_MASK_CANCEL</name>
              <description>this field is used to cancel NMI mask disable function.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
